{
  "url": "https://www.rescue.org/article/decade-war-10-voices-yemen",
  "title": "A decade of war: 10 voices from Yemen | International Rescue Committee (IRC)",
  "text": "Yemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nWhat is happening in Yemen? After ten years of war, Yemenis are not just living through a humanitarian crisis—they are fighting to survive. With the economy in ruins, millions displaced, and the healthcare system on the verge of collapse, over 19 million people are struggling to meet even their most basic needs. As humanitarian funding falls short, countless families are at risk of losing access to critical support.  The cuts in funding for aid are not just numbers on a page; they mean fewer food distributions, a shrinking supply of medicine and diminished opportunities for families to earn an income. They mean more people forced to make dangerous journeys through conflict zones just to fetch clean water, rising cases of cholera and other preventable diseases, and a worsening nutrition crisis. Millions will face worsening conditions without sustained support, especially in frontline areas where needs are already extensive and growing.  Give todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowBelow, ten stories from Yemen, told by the people enduring the crisis and those working to help them, offer a window into the human toll of this decade-long conflict. Holding on through fearNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\"Our lives completely changed when we became displaced,” says Narmin. “We went from having a stable home to living in an insecure camp. I lost my sense of security—not just for myself, but for my entire family. The fear we live in is constant.” Since being displaced, Narmin resides in Al-Qutaysh Camp, where her family has received support from the IRC.  “The assistance we received alleviated some of the struggles, but without it, I honestly don’t know how we would survive. We’d likely have to resort to begging or other desperate acts.\"After living through ten years of conflict, Narmin wishes the world could understand how it feels to live without basic necessities and a sense of security.  Her biggest hope is for the war to end soon, so her family can return home in peace.  The price of stolen stability Abdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"Before the war, I had a job that supported my family. But after the conflictand our displacement, all of that was taken away,” Abdulnasser explains. “I remember the first time I heard the sounds of war—I felt a fear I had never known before. We lost our home, our livelihood, and most importantly, our sense of security.” With support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions.  “Living in this camp is a daily struggle with no privacy or safety,” he says, despite the significant difference the support has made for him. “I just want to feel safe again. This war has stolen our stability and our lives. For the sake of my children, I hope it ends soon.\" Hope beyond survivalHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\"I never imagined that displacement would last so long,” Haifa recalls. “We left behind our home, our livestock - everything we had worked for - thinking we would return soon. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"In Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “I joined a project in hopes of rebuilding my life, not just physically, but emotionally,” she explains. “Learning a new skill gave me hope, and I saw an opportunity for my husband to find work, too.” This support in becoming self-sufficient again was critical for Haifa’s family, and she emphasizes the need for more opportunities like this for others. “My greatest wish is to provide a better future for my children,” she says of her future hopes. “We need peace so families like mine can live with dignity and start over.”  Fighting an invisible battleMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“Before the war, I had a stable life. But when the conflict started, I began experiencing severe mental health challenges, unable to work or look after myself,” recalls 39-year-old Mohammed. “Without easy access to my medications, my condition deteriorated.” Mohammed is one of thousands of Yemenis struggling with the psychological impacts of prolonged war. Through IRC-supported psychosocial support and access to essential medication, he is starting to rebuild his life. “The mental health support that I received from the IRC was life changing. Now, I’m able to work again and help support my family,” says Mohammed. “But if the funding dries up, I, and others like me, will relapse. Mental health services can save lives. They must continue.” Lessons learned from warDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCDr. Maram, who works as a psychiatrist for the IRC, recalls the very start of the war in Yemen: “The first airstrike changed everything. I was on the bus; people were panicking and running. I held my mother and cried that night.”  “Over the years, I have seen the war cause a deep chasm between rich and poor. I once cared for a man who lived on the street, foraging for meals in the garbage. With therapy and medication, he reconnected with his family and found his way back to life. But these critical services are now at risk due to funding cuts. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.” A lost decade for young peopleAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCAmr represents a generation of young Yemenis whose futures were upended by war. “The war robbed me of my academic dreams,” he explains. “I still remember when my family first said the conflict had started — I couldn’t have imagined it would last this long. Each year I wish for something better in the next one.” In 2020, he entered humanitarian work, delivering essential health services with the IRC. “I find purpose in moments like seeing a father walk out of our clinic with free medication for his child,” says Amr. “But cuts to funding mean that many won’t get the treatment they need. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.” Medicine and warInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. “Getting food and gas was a nightmare. My child asked me, ‘Why are people dying?’ and I had no answer.”  Inas has spent years ensuring families in crisis can access lifesaving medications. “I recall one mother walking for hours just to obtain some medicine for her child,” she says. “If funding is reduced, maternal and child health services will decline even more. We must act now to prevent the collapse of Yemen’s health system.” A journey in search of hope“Ten years of war have robbed progress from our lives,” explains Abdulmalik. “I still recall when the fighting broke out in Aden, when our small house became a shelter for displaced relatives. Finding flour or gas became a full-day struggle.”  In his role as a Senior Water, Sanitation and Hygiene manager, Abdulmalik is witnessing firsthand how malnutrition and floods are taking a toll on frontline communities.  “I carry on because I see the joy on people’s faces when we bring clean water,” he emphasizes. “But funding cuts could cause critical services like sanitation to collapse, resulting in outbreaks of disease. What Yemen needs is infrastructure, education, and peace to heal.” From despair to hopeMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war started, I lost nine friends who were trying to escape. My family was displaced, I was alone, homeless and had nothing to eat,” says 34-year-old Mohammed.  “Now, working in emergency response, I see that same struggle in others. One young man, severely depressed after losing his job, joined our vocational training - and today, he owns a successful business. These programs change lives. Cutting humanitarian aid would be a catastrophe.” A disaster unfoldingSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams.  “Despite all the hardship, we continue to work, bringing medical aid to those who need it most. Yet, with humanitarian aid running low, I fear that without it, many lives will be lost. “Every day, I see the rising need for programs that save lives, whether they be in health, food, or peacebuilding. But we are now seeing these critical programs being cut back, which is a disaster unfolding before our eyes. The world must continue these vital programs to prevent further suffering.\" The IRC in Yemen The International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. Since then, we’ve been providing emergency aid, healthcare, support for families to rebuild their livelihoods, and protection for women and children.  In 2024 alone, we reached more than 1.7 million Yemenis with lifesaving support—standing by communities as they navigate unimaginable challenges. What needs to happen now? Long-term stability requires political solutions and economic recovery. But right now, humanitarian aid is the only lifeline for millions. For families like Mohammed’s, Narmin’s, Abdulnasser’s and Haifa’s, it means food, healthcare, and a measure of dignity in the absence of peace. Sustained donor engagement and flexible funding are crucial to preventing further catastrophe. Without immediate action, years of humanitarian progress will be undone, deepening the crisis and leaving millions without essential support. “We urge all donors to step up and fully fund the response before it is too late,” says IRC country director for Yemen, Caroline Sekyewa. How can I help? Now, more than ever, your support is urgently needed to help humanitarian organizations continue to deliver lifesaving services. Donate: Your contribution helps the IRC provide lifesaving healthcare, nutrition and protection services to families in Yemen and beyond. Support our work in over 40 countries and ensure aid reaches those who need it most. Give todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowGet connected: Follow our Instagram, LinkedIn, Facebook, Bluesky and X accounts. Stay informed: Follow our coverage of U.S. news for a humanitarian perspective. \n\n\n\nExplore related topics:YemenRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribeFollow UsRescue Websites:U.S./GlobalUKGermanySwedenEUKoreaPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud PreventionInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.Copyright © International Rescue Committee, 2025.\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.  March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.\n\nYemen War\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.\n\nMillions are enduring a humanitarian crisis in Yemen. This photo essay tells their story.\n\nMarch 26, 2025\nLast updated:  March 26, 2025\n\nMarch 26, 2025\nLast updated:  March 26, 2025\n\nMarch 26, 2025\n\nLast updated:  March 26, 2025\n\nWhat is happening in Yemen? After ten years of war, Yemenis are not just living through a humanitarian crisis—they are fighting to survive. With the economy in ruins, millions displaced, and the healthcare system on the verge of collapse, over 19 million people are struggling to meet even their most basic needs. As humanitarian funding falls short, countless families are at risk of losing access to critical support.  The cuts in funding for aid are not just numbers on a page; they mean fewer food distributions, a shrinking supply of medicine and diminished opportunities for families to earn an income. They mean more people forced to make dangerous journeys through conflict zones just to fetch clean water, rising cases of cholera and other preventable diseases, and a worsening nutrition crisis. Millions will face worsening conditions without sustained support, especially in frontline areas where needs are already extensive and growing.  Give todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowBelow, ten stories from Yemen, told by the people enduring the crisis and those working to help them, offer a window into the human toll of this decade-long conflict. Holding on through fearNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\"Our lives completely changed when we became displaced,” says Narmin. “We went from having a stable home to living in an insecure camp. I lost my sense of security—not just for myself, but for my entire family. The fear we live in is constant.” Since being displaced, Narmin resides in Al-Qutaysh Camp, where her family has received support from the IRC.  “The assistance we received alleviated some of the struggles, but without it, I honestly don’t know how we would survive. We’d likely have to resort to begging or other desperate acts.\"After living through ten years of conflict, Narmin wishes the world could understand how it feels to live without basic necessities and a sense of security.  Her biggest hope is for the war to end soon, so her family can return home in peace.  The price of stolen stability Abdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"Before the war, I had a job that supported my family. But after the conflictand our displacement, all of that was taken away,” Abdulnasser explains. “I remember the first time I heard the sounds of war—I felt a fear I had never known before. We lost our home, our livelihood, and most importantly, our sense of security.” With support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions.  “Living in this camp is a daily struggle with no privacy or safety,” he says, despite the significant difference the support has made for him. “I just want to feel safe again. This war has stolen our stability and our lives. For the sake of my children, I hope it ends soon.\" Hope beyond survivalHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\"I never imagined that displacement would last so long,” Haifa recalls. “We left behind our home, our livestock - everything we had worked for - thinking we would return soon. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"In Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “I joined a project in hopes of rebuilding my life, not just physically, but emotionally,” she explains. “Learning a new skill gave me hope, and I saw an opportunity for my husband to find work, too.” This support in becoming self-sufficient again was critical for Haifa’s family, and she emphasizes the need for more opportunities like this for others. “My greatest wish is to provide a better future for my children,” she says of her future hopes. “We need peace so families like mine can live with dignity and start over.”  Fighting an invisible battleMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“Before the war, I had a stable life. But when the conflict started, I began experiencing severe mental health challenges, unable to work or look after myself,” recalls 39-year-old Mohammed. “Without easy access to my medications, my condition deteriorated.” Mohammed is one of thousands of Yemenis struggling with the psychological impacts of prolonged war. Through IRC-supported psychosocial support and access to essential medication, he is starting to rebuild his life. “The mental health support that I received from the IRC was life changing. Now, I’m able to work again and help support my family,” says Mohammed. “But if the funding dries up, I, and others like me, will relapse. Mental health services can save lives. They must continue.” Lessons learned from warDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCDr. Maram, who works as a psychiatrist for the IRC, recalls the very start of the war in Yemen: “The first airstrike changed everything. I was on the bus; people were panicking and running. I held my mother and cried that night.”  “Over the years, I have seen the war cause a deep chasm between rich and poor. I once cared for a man who lived on the street, foraging for meals in the garbage. With therapy and medication, he reconnected with his family and found his way back to life. But these critical services are now at risk due to funding cuts. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.” A lost decade for young peopleAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCAmr represents a generation of young Yemenis whose futures were upended by war. “The war robbed me of my academic dreams,” he explains. “I still remember when my family first said the conflict had started — I couldn’t have imagined it would last this long. Each year I wish for something better in the next one.” In 2020, he entered humanitarian work, delivering essential health services with the IRC. “I find purpose in moments like seeing a father walk out of our clinic with free medication for his child,” says Amr. “But cuts to funding mean that many won’t get the treatment they need. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.” Medicine and warInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. “Getting food and gas was a nightmare. My child asked me, ‘Why are people dying?’ and I had no answer.”  Inas has spent years ensuring families in crisis can access lifesaving medications. “I recall one mother walking for hours just to obtain some medicine for her child,” she says. “If funding is reduced, maternal and child health services will decline even more. We must act now to prevent the collapse of Yemen’s health system.” A journey in search of hope“Ten years of war have robbed progress from our lives,” explains Abdulmalik. “I still recall when the fighting broke out in Aden, when our small house became a shelter for displaced relatives. Finding flour or gas became a full-day struggle.”  In his role as a Senior Water, Sanitation and Hygiene manager, Abdulmalik is witnessing firsthand how malnutrition and floods are taking a toll on frontline communities.  “I carry on because I see the joy on people’s faces when we bring clean water,” he emphasizes. “But funding cuts could cause critical services like sanitation to collapse, resulting in outbreaks of disease. What Yemen needs is infrastructure, education, and peace to heal.” From despair to hopeMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war started, I lost nine friends who were trying to escape. My family was displaced, I was alone, homeless and had nothing to eat,” says 34-year-old Mohammed.  “Now, working in emergency response, I see that same struggle in others. One young man, severely depressed after losing his job, joined our vocational training - and today, he owns a successful business. These programs change lives. Cutting humanitarian aid would be a catastrophe.” A disaster unfoldingSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams.  “Despite all the hardship, we continue to work, bringing medical aid to those who need it most. Yet, with humanitarian aid running low, I fear that without it, many lives will be lost. “Every day, I see the rising need for programs that save lives, whether they be in health, food, or peacebuilding. But we are now seeing these critical programs being cut back, which is a disaster unfolding before our eyes. The world must continue these vital programs to prevent further suffering.\" The IRC in Yemen The International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. Since then, we’ve been providing emergency aid, healthcare, support for families to rebuild their livelihoods, and protection for women and children.  In 2024 alone, we reached more than 1.7 million Yemenis with lifesaving support—standing by communities as they navigate unimaginable challenges. What needs to happen now? Long-term stability requires political solutions and economic recovery. But right now, humanitarian aid is the only lifeline for millions. For families like Mohammed’s, Narmin’s, Abdulnasser’s and Haifa’s, it means food, healthcare, and a measure of dignity in the absence of peace. Sustained donor engagement and flexible funding are crucial to preventing further catastrophe. Without immediate action, years of humanitarian progress will be undone, deepening the crisis and leaving millions without essential support. “We urge all donors to step up and fully fund the response before it is too late,” says IRC country director for Yemen, Caroline Sekyewa. How can I help? Now, more than ever, your support is urgently needed to help humanitarian organizations continue to deliver lifesaving services. Donate: Your contribution helps the IRC provide lifesaving healthcare, nutrition and protection services to families in Yemen and beyond. Support our work in over 40 countries and ensure aid reaches those who need it most. Give todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowGet connected: Follow our Instagram, LinkedIn, Facebook, Bluesky and X accounts. Stay informed: Follow our coverage of U.S. news for a humanitarian perspective.\n\nAfter ten years of war, Yemenis are not just living through a humanitarian crisis—they are fighting to survive. With the economy in ruins, millions displaced, and the healthcare system on the verge of collapse, over 19 million people are struggling to meet even their most basic needs. As humanitarian funding falls short, countless families are at risk of losing access to critical support.\n\nThe cuts in funding for aid are not just numbers on a page; they mean fewer food distributions, a shrinking supply of medicine and diminished opportunities for families to earn an income. They mean more people forced to make dangerous journeys through conflict zones just to fetch clean water, rising cases of cholera and other preventable diseases, and a worsening nutrition crisis. Millions will face worsening conditions without sustained support, especially in frontline areas where needs are already extensive and growing.\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nGive today\n\nFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nDonate now\n\nBelow, ten stories from Yemen, told by the people enduring the crisis and those working to help them, offer a window into the human toll of this decade-long conflict.\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh Camp\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"Our lives completely changed when we became displaced,” says Narmin. “We went from having a stable home to living in an insecure camp. I lost my sense of security—not just for myself, but for my entire family. The fear we live in is constant.”\n\nSince being displaced, Narmin resides in Al-Qutaysh Camp, where her family has received support from the IRC.\n\n“The assistance we received alleviated some of the struggles, but without it, I honestly don’t know how we would survive. We’d likely have to resort to begging or other desperate acts.\"\n\nAfter living through ten years of conflict, Narmin wishes the world could understand how it feels to live without basic necessities and a sense of security.  Her biggest hope is for the war to end soon, so her family can return home in peace.\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"Before the war, I had a job that supported my family. But after the conflictand our displacement, all of that was taken away,” Abdulnasser explains. “I remember the first time I heard the sounds of war—I felt a fear I had never known before. We lost our home, our livelihood, and most importantly, our sense of security.”\n\nWith support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions.\n\n“Living in this camp is a daily struggle with no privacy or safety,” he says, despite the significant difference the support has made for him. “I just want to feel safe again. This war has stolen our stability and our lives. For the sake of my children, I hope it ends soon.\"\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"I never imagined that displacement would last so long,” Haifa recalls. “We left behind our home, our livestock - everything we had worked for - thinking we would return soon. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"\n\nIn Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “I joined a project in hopes of rebuilding my life, not just physically, but emotionally,” she explains. “Learning a new skill gave me hope, and I saw an opportunity for my husband to find work, too.”\n\nThis support in becoming self-sufficient again was critical for Haifa’s family, and she emphasizes the need for more opportunities like this for others. “My greatest wish is to provide a better future for my children,” she says of her future hopes. “We need peace so families like mine can live with dignity and start over.”\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“Before the war, I had a stable life. But when the conflict started, I began experiencing severe mental health challenges, unable to work or look after myself,” recalls 39-year-old Mohammed. “Without easy access to my medications, my condition deteriorated.”\n\nMohammed is one of thousands of Yemenis struggling with the psychological impacts of prolonged war. Through IRC-supported psychosocial support and access to essential medication, he is starting to rebuild his life.\n\n“The mental health support that I received from the IRC was life changing. Now, I’m able to work again and help support my family,” says Mohammed. “But if the funding dries up, I, and others like me, will relapse. Mental health services can save lives. They must continue.”\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram, who works as a psychiatrist for the IRC, recalls the very start of the war in Yemen: “The first airstrike changed everything. I was on the bus; people were panicking and running. I held my mother and cried that night.”\n\n“Over the years, I have seen the war cause a deep chasm between rich and poor. I once cared for a man who lived on the street, foraging for meals in the garbage. With therapy and medication, he reconnected with his family and found his way back to life. But these critical services are now at risk due to funding cuts. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.”\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr represents a generation of young Yemenis whose futures were upended by war. “The war robbed me of my academic dreams,” he explains. “I still remember when my family first said the conflict had started — I couldn’t have imagined it would last this long. Each year I wish for something better in the next one.”\n\nIn 2020, he entered humanitarian work, delivering essential health services with the IRC. “I find purpose in moments like seeing a father walk out of our clinic with free medication for his child,” says Amr. “But cuts to funding mean that many won’t get the treatment they need. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.”\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. “Getting food and gas was a nightmare. My child asked me, ‘Why are people dying?’ and I had no answer.”\n\nInas has spent years ensuring families in crisis can access lifesaving medications. “I recall one mother walking for hours just to obtain some medicine for her child,” she says. “If funding is reduced, maternal and child health services will decline even more. We must act now to prevent the collapse of Yemen’s health system.”\n\n“Ten years of war have robbed progress from our lives,” explains Abdulmalik. “I still recall when the fighting broke out in Aden, when our small house became a shelter for displaced relatives. Finding flour or gas became a full-day struggle.”\n\nIn his role as a Senior Water, Sanitation and Hygiene manager, Abdulmalik is witnessing firsthand how malnutrition and floods are taking a toll on frontline communities.\n\n“I carry on because I see the joy on people’s faces when we bring clean water,” he emphasizes. “But funding cuts could cause critical services like sanitation to collapse, resulting in outbreaks of disease. What Yemen needs is infrastructure, education, and peace to heal.”\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“When the war started, I lost nine friends who were trying to escape. My family was displaced, I was alone, homeless and had nothing to eat,” says 34-year-old Mohammed.\n\n“Now, working in emergency response, I see that same struggle in others. One young man, severely depressed after losing his job, joined our vocational training - and today, he owns a successful business. These programs change lives. Cutting humanitarian aid would be a catastrophe.”\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams.\n\n“Despite all the hardship, we continue to work, bringing medical aid to those who need it most. Yet, with humanitarian aid running low, I fear that without it, many lives will be lost.\n\n“Every day, I see the rising need for programs that save lives, whether they be in health, food, or peacebuilding. But we are now seeing these critical programs being cut back, which is a disaster unfolding before our eyes. The world must continue these vital programs to prevent further suffering.\"\n\nThe International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. Since then, we’ve been providing emergency aid, healthcare, support for families to rebuild their livelihoods, and protection for women and children.\n\nIn 2024 alone, we reached more than 1.7 million Yemenis with lifesaving support—standing by communities as they navigate unimaginable challenges.\n\nLong-term stability requires political solutions and economic recovery. But right now, humanitarian aid is the only lifeline for millions. For families like Mohammed’s, Narmin’s, Abdulnasser’s and Haifa’s, it means food, healthcare, and a measure of dignity in the absence of peace.\n\nSustained donor engagement and flexible funding are crucial to preventing further catastrophe. Without immediate action, years of humanitarian progress will be undone, deepening the crisis and leaving millions without essential support.\n\n“We urge all donors to step up and fully fund the response before it is too late,” says IRC country director for Yemen, Caroline Sekyewa.\n\nNow, more than ever, your support is urgently needed to help humanitarian organizations continue to deliver lifesaving services.\n\nDonate: Your contribution helps the IRC provide lifesaving healthcare, nutrition and protection services to families in Yemen and beyond. Support our work in over 40 countries and ensure aid reaches those who need it most.\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nGive today\n\nFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.\n\nDonate now\n\nGet connected: Follow our Instagram, LinkedIn, Facebook, Bluesky and X accounts.\n\nStay informed: Follow our coverage of U.S. news for a humanitarian perspective.\n\nExplore related topics:YemenRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nRelated news & features\n\nRelated news & features\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023\n\nUkraine crisis\n\nUkraine crisis\n\nOne year on: life inside Ukraine\n\nFebruary 23, 2023\n\nFebruary 23, 2023\n\nUkraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024\n\nUkraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024\n\nUkraine crisis\n\nUkraine crisis\n\nUkraine: Stories of resilience amid two years of war and a decade of conflict\n\nFebruary 15, 2024\n\nFebruary 15, 2024\n\nA resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024\n\nA resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024\n\nA resettlement story\n\nA resettlement story\n\nHow Uber is helping resettled refugee families navigate their new lives\n\nSeptember 10, 2024\n\nSeptember 10, 2024\n\nFood insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nFood insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nFood insecurity\n\nFood insecurity\n\nPhoto story: A mobile health team treats malnutrition in Yemen\n\nDecember 20, 2023\n\nDecember 20, 2023\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribeFollow UsRescue Websites:U.S./GlobalUKGermanySwedenEUKoreaPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud PreventionInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.Copyright © International Rescue Committee, 2025.\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribeFollow Us\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribeFollow Us\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics Hotline\n\nCrisis Watch\n\nCrisis Watch\n\nWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics Hotline\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency\n\n87% Program services7% Management and general6% FundraisingDonate\n\n87% Program services7% Management and general6% FundraisingDonate\n\nDonate\n\nJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribeFollow Us\n\nJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribe\n\nJoin our mailing list\n\nGet the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.\n     \n\n  \n  \n          \n        \n                  \n \n    \nSubscribe\n\nFollow Us\n\nFollow Us\n\nRescue Websites:U.S./GlobalUKGermanySwedenEUKoreaPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud PreventionInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.Copyright © International Rescue Committee, 2025.\n\nRescue Websites:U.S./GlobalUKGermanySwedenEUKoreaPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud PreventionInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.Copyright © International Rescue Committee, 2025.\n\nRescue Websites:U.S./GlobalUKGermanySwedenEUKorea\n\nRescue Websites:U.S./GlobalUKGermanySwedenEUKorea\n\nRescue Websites:U.S./GlobalUKGermanySwedenEUKorea\n\nPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud Prevention\n\nPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud Prevention\n\nPhone Opt OutRespecting Your PrivacyTerms and ConditionsFraud Prevention\n\nInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.\n\nInternational Rescue Committee is a 501(c)(3) not-for-profit organization. EIN number 13-5660870.\n\nCopyright © International Rescue Committee, 2025.\n\nCopyright © International Rescue Committee, 2025.\n\n×\n\n\n\n\n\n\n\nSearch\n\n×\n\n\n\n\n\n\n\nSearch\n\n×\n\n×\n\nSearch\n\nSearch\n\nSearch\n\nSearch\n\nSearch\n\nSearch",
  "date": "",
  "source_type": "NGO",
  "extracted_at": "2025-04-07T13:52:24.078352",
  "metadata": {
    "description": "10 years of war in Yemen have created a humanitarian emergency. Now, families are at risk of losing access to vital services—these are their stories.",
    "og:site_name": "The IRC"
  },
  "relevance_score": 0.4083333333333333,
  "summary": "Yemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowBelow, ten stories from Yemen, told by the people enduring the crisis and those working to help them, offer a window into the human toll of this decade-long conflict. Holding on through fearNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\"Our lives completely changed when we became displaced,” says Narmin. The price of stolen stability Abdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"Before the war, I had a job that supported my family. We lost our home, our livelihood, and most importantly, our sense of security.” With support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions. For the sake of my children, I hope it ends soon.\" Hope beyond survivalHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\"I never imagined that displacement would last so long,” Haifa recalls. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"In Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “We need peace so families like mine can live with dignity and start over.”  Fighting an invisible battleMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“Before the war, I had a stable life. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.” A lost decade for young peopleAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCAmr represents a generation of young Yemenis whose futures were upended by war. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.” Medicine and warInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. We must act now to prevent the collapse of Yemen’s health system.” A journey in search of hope“Ten years of war have robbed progress from our lives,” explains Abdulmalik. What Yemen needs is infrastructure, education, and peace to heal.” From despair to hopeMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war started, I lost nine friends who were trying to escape. Cutting humanitarian aid would be a catastrophe.” A disaster unfoldingSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams. The world must continue these vital programs to prevent further suffering.\" The IRC in Yemen The International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. Explore related topics:YemenRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference. Yemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nYemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. Yemen War    A decade of war: 10 voices from Yemen\n\nMillions are enduring a humanitarian crisis in Yemen. Yemen War\n\nMillions are enduring a humanitarian crisis in Yemen. March 26, 2025\nLast updated:  March 26, 2025\n\nMarch 26, 2025\nLast updated:  March 26, 2025\n\nMarch 26, 2025\n\nLast updated:  March 26, 2025\n\nWhat is happening in Yemen? With aid cuts looming, your support is needed to sustain life-saving programs.Donate nowBelow, ten stories from Yemen, told by the people enduring the crisis and those working to help them, offer a window into the human toll of this decade-long conflict. Holding on through fearNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\"Our lives completely changed when we became displaced,” says Narmin. The price of stolen stability Abdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"Before the war, I had a job that supported my family. We lost our home, our livelihood, and most importantly, our sense of security.” With support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions. For the sake of my children, I hope it ends soon.\" Hope beyond survivalHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\"I never imagined that displacement would last so long,” Haifa recalls. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"In Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “We need peace so families like mine can live with dignity and start over.”  Fighting an invisible battleMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“Before the war, I had a stable life. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.” A lost decade for young peopleAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRCAmr represents a generation of young Yemenis whose futures were upended by war. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.” Medicine and warInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. We must act now to prevent the collapse of Yemen’s health system.” A journey in search of hope“Ten years of war have robbed progress from our lives,” explains Abdulmalik. What Yemen needs is infrastructure, education, and peace to heal.” From despair to hopeMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC“When the war started, I lost nine friends who were trying to escape. Cutting humanitarian aid would be a catastrophe.” A disaster unfoldingSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams. The world must continue these vital programs to prevent further suffering.\" The IRC in Yemen The International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. Narmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh CampPhoto: Gabreez-Saleh Hayyan for the IRC\n\nNarmin Saleh Salem, 26 years, Al-Qutaysh Camp\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"Our lives completely changed when we became displaced,” says Narmin. Abdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nAbdulnasser Abdu Abdullah, 35 years, Al Dhale’e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"Before the war, I had a job that supported my family. We lost our home, our livelihood, and most importantly, our sense of security.”\n\nWith support from the IRC’s healthcare services, Abdulnasser has been able to access essential treatment for his family amid deteriorating conditions. For the sake of my children, I hope it ends soon.\"\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nHaifa Mansour, 35 years, Al-Dhale'e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"I never imagined that displacement would last so long,” Haifa recalls. But years passed, and not only did we lose our home, but we also lost our means of earning a living.\"\n\nIn Al-Dhale'e, Haifa joined an IRC cash-for-work program that helps displaced Yemenis earn an income and rebuild their lives. “We need peace so families like mine can live with dignity and start over.”\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Salem, 39 years old, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“Before the war, I had a stable life. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Maram Al-Jafri, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nDr. Yemen requires robust healthcare infrastructure, skilled personnel, and sustained peace.”\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr Saleh, 31 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\nAmr represents a generation of young Yemenis whose futures were upended by war. After 10 years, we need to move from emergency assistance to sustainable solutions, especially education, to avoid a lost generation.”\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nInas Radman, 49 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“When the war broke out, I sheltered three displaced families in our small house,” says 49-year-old IRC pharmacist and mother, Inas. We must act now to prevent the collapse of Yemen’s health system.”\n\n“Ten years of war have robbed progress from our lives,” explains Abdulmalik. What Yemen needs is infrastructure, education, and peace to heal.”\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, AdenPhoto: Gabreez-Saleh Hayyan for the IRC\n\nMohammed Asaad, 34 years, Aden\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n“When the war started, I lost nine friends who were trying to escape. Cutting humanitarian aid would be a catastrophe.”\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’ePhoto: Gabreez-Saleh Hayyan for the IRC\n\nSaad Ahmed Naji, 55 years, Al Dhale’e\n\nPhoto: Gabreez-Saleh Hayyan for the IRC\n\n\"The hardest thing I’ve witnessed is families fleeing their homes, terrified by the bombs that explode on their streets,” says Saad, who leads one of the IRC’s mobile health teams. The world must continue these vital programs to prevent further suffering.\"\n\nThe International Rescue Committee (IRC) has been on the ground in Yemen since 2012, and in 2015, we scaled up our work as the conflict deepened and people’s needs grew. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. With aid cuts looming, your support is needed to sustain life-saving programs.Donate now\n\nGive todayFamilies in Yemen have endured a decade of war. Explore related topics:YemenRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nExplore related topics:Yemen\n\nRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nRelated news & featuresUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nRelated news & features\n\nRelated news & features\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023Ukraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024A resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024Food insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023\n\nUkraine crisisOne year on: life inside UkraineFebruary 23, 2023\n\nUkraine crisis\n\nUkraine crisis\n\nOne year on: life inside Ukraine\n\nFebruary 23, 2023\n\nFebruary 23, 2023\n\nUkraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024\n\nUkraine crisisUkraine: Stories of resilience amid two years of war and a decade of conflictFebruary 15, 2024\n\nUkraine crisis\n\nUkraine crisis\n\nUkraine: Stories of resilience amid two years of war and a decade of conflict\n\nFebruary 15, 2024\n\nFebruary 15, 2024\n\nA resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024\n\nA resettlement storyHow Uber is helping resettled refugee families navigate their new livesSeptember 10, 2024\n\nA resettlement story\n\nA resettlement story\n\nHow Uber is helping resettled refugee families navigate their new lives\n\nSeptember 10, 2024\n\nSeptember 10, 2024\n\nFood insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nFood insecurityPhoto story: A mobile health team treats malnutrition in YemenDecember 20, 2023\n\nFood insecurity\n\nFood insecurity\n\nPhoto story: A mobile health team treats malnutrition in Yemen\n\nDecember 20, 2023\n\nDecember 20, 2023\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference. Crisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference. SubscribeFollow Us\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics HotlineOur efficiency87% Program services7% Management and general6% FundraisingDonateJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference. SubscribeFollow Us\n\nCrisis WatchWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics Hotline\n\nCrisis Watch\n\nCrisis Watch\n\nWho We AreWhere We WorkWhat We DoHow To HelpLatestCareersContact UsDonor HelpCode of ConductEthics Hotline\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency87% Program services7% Management and general6% FundraisingDonate\n\nOur efficiency\n\n87% Program services7% Management and general6% FundraisingDonate\n\n87% Program services7% Management and general6% FundraisingDonate\n\nDonate\n\nJoin our mailing list\n    Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.",
  "entities": {
    "countries": [
      "germany",
      "yemen"
    ],
    "organizations": [
      "un",
      "who"
    ],
    "key_issues": [
      "challenge",
      "crisis",
      "country",
      "nation",
      "solution",
      "program",
      "action",
      "humanitarian",
      "aid",
      "assistance",
      "economic",
      "economy",
      "un",
      "organization"
    ]
  },
  "committee": "Third Committee",
  "topic": "Affirming the rights of communities displaced by violence"
}