{
  "url": "https://www.un.org/womenwatch/daw/beijing/platform/poverty.htm",
  "title": "Fourth World Conference on Women, Beijing 1995",
  "text": "Home | Contact Us\n\nAbout\r\n          us\n\nAbout\r\n          us\n\nBeijing and \r\n          its Follow-up\n\nCSW\n\nECOSOC\n\nGeneral Assembly\n\nExpert Group\r\n          Meetings\n\nViolence against\r\n            Women\n\nViolence against\r\n            Women\n\nPublications\n\nNGO Participation\n\nTechnical Cooperation\n\nFirst World Conference\nSecond World Conference\nThird World Conference\n\nFourth World Conference\n\n\nBeijing Declaration \n Platform For Action \nOfficial Documents \nStatements By Governments \nStatements by United Nations and Inter-governmental Organizations Statements by Non-governmental Organizations \nThe Platform for Action, DPI Brochure \nPhoto Gallery \n\n\n\n\nFive-year Review and Appraisal \n\n\nBeijing+5 and beyond \nDocuments \nSummaries of panel discussions \nResponses to  Questionnaire \nPress kit\nPre-session briefing\nProgramme of Activities\nNGO participation\n\n\n\n\nTen-year Review and Appraisal  \n\n\nOverview\n\nDraft Provisional Agenda\nOfficial Documents\nResolutions\nStatements\nHigh-Level Events\nNGO Participation\nSide/Parallel Events\nQuestionnaire to Member States\nResponses\nExpert Group Meetings \nRegional Processes\nRelevant Links\nBeijing at Ten and Beyond\n\n\nFifteen-year Review and Appraisal  \n\n\nNational level review of implementation\n\nQuestionnaire\nMember States responses\n\n\nRegional 15-year review processes\n \nRegional reports\nRegional meetings\n\nGlobal 15-year review process in the 54th session of the Commission on the Status of Women\n \nOverview\nDocumentation\nInteractive events\nOutcome\nParticipation\n\nCommemoration of the 15th anniversary by the General Assembly\nRelated intergovernmental processes\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty \n\n\nThe United Nations\r\n          Fourth World Conference on Women\nBeijing, China - September 1995\r\n        Action for Equality, Development and Peace        \nPLATFORM FOR ACTION  \nWomen and Poverty Diagnosis \n \n\n\nStrategic objective A.1. Review, adopt and maintain macroeconomic policies and development strategies that address the needs and efforts of women in poverty. Actions to be taken.            \n\n\n Strategic objective A.2. Revise laws and administrative practices to ensure women's equal rights and access to economic resources. Actions to be taken.          \n Strategic objective A.3. Provide women with access to savings and credit mechanisms and institutions. Actions to be taken.          \n Strategic objective A.4. Develop gender-based methodologies and conduct research to address the feminization of poverty. Actions to be taken.          \n \n\nWomen and Poverty follow-up (Under construction)        \n \n  Go back to Index \n\n\n\n\n\n \nA.  Women and Poverty\n \n\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries.  Poverty has various causes, including\r\n              structural ones. \r\n              Poverty is a complex, multidimensional problem, with origins in\r\n              both the\r\n              national and international domains.  The globalization of the\r\n              world's economy\r\n              and the deepening interdependence among nations present\r\n              challenges and\r\n              opportunities for sustained economic growth and development, as\r\n              well as risks\r\n              and uncertainties for the future of the world economy.  The\r\n              uncertain global\r\n              economic climate has been accompanied by economic restructuring\r\n              as well as, in\r\n              a certain number of countries, persistent, unmanageable levels of\r\n              external\r\n              debt and structural adjustment programmes.  In addition, all\r\n              types of\r\n              conflict, displacement of people and environmental degradation\r\n              have undermined\r\n              the capacity of Governments to meet the basic needs of their\r\n              populations. \r\n              Transformations in the world economy are profoundly changing the\r\n              parameters of\r\n              social development in all countries.  One significant trend has\r\n              been the\r\n              increased poverty of women, the extent of which varies from\r\n              region to region. \r\n              The gender disparities in economic power-sharing are also an\r\n              important\r\n              contributing factor to the poverty of women.  Migration and\r\n              consequent changes\r\n              in family structures have placed additional burdens on women,\r\n              especially those\r\n              who provide for several dependants.  Macroeconomic policies need\r\n              rethinking\r\n              and reformulation to address such trends.  These policies focus\r\n              almost\r\n              exclusively on the formal sector.  They also tend to impede the\r\n              initiatives of\r\n              women and fail to consider the differential impact on women and\r\n              men.  The\r\n              application of gender analysis to a wide range of policies and\r\n              programmes is\r\n              therefore critical to poverty reduction strategies.  In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty.  The eradication of\r\n              poverty cannot\r\n              be accomplished through anti-poverty programmes alone but will\r\n              require\r\n              democratic participation and changes in economic structures in\r\n              order to ensure\r\n              access for all women to resources, opportunities and public\r\n              services.  Poverty\r\n              has various manifestations, including lack of income and\r\n              productive resources\r\n              sufficient to ensure a sustainable livelihood; hunger and\r\n              malnutrition; ill\r\n              health; limited or lack of access to education and other basic\r\n              services;\r\n              increasing morbidity and mortality from illness; homelessness and\r\n              inadequate\r\n              housing; unsafe environments; and social discrimination and\r\n              exclusion.  It is\r\n              also characterized by lack of participation in decision-making\r\n              and in civil,\r\n              social and cultural life.  It occurs in all countries - as mass\r\n              poverty in\r\n              many developing countries and as pockets of poverty amidst wealth\r\n              in developed\r\n              countries.  Poverty may be caused by an economic recession that\r\n              results in\r\n              loss of livelihood or by disaster or conflict.  There is also the\r\n              poverty of low-wage workers and the utter destitution of people who fall\r\n              outside family\r\n              support systems, social institutions and safety nets. \n\n\n \n\n\nIn the past decade the number of women living in poverty has\r\n              increased\r\n              disproportionately to the number of men, particularly in the\r\n              developing\r\n              countries.  The feminization of poverty has also recently become\r\n              a significant\r\n              problem in the countries with economies in transition as a\r\n              short-term\r\n              consequence of the process of political, economic and social\r\n              transformation. \r\n              In addition to economic factors, the rigidity of socially\r\n              ascribed gender\r\n              roles and women's limited access to power, education, training\r\n              and productive\r\n              resources as well as other emerging factors that may lead to\r\n              insecurity for\r\n              families are also responsible.  The failure to adequately\r\n              mainstream a gender\r\n              perspective in all economic analysis and planning and to address\r\n              the\r\n              structural causes of poverty is also a contributing factor.            \n \n\n\nWomen contribute to the economy and to combating poverty\r\n              through both\r\n              remunerated and unremunerated work at home, in the community and\r\n              in the\r\n              workplace.  The empowerment of women is a critical factor in the\r\n              eradication\r\n              of poverty.            \n \n\n\nWhile poverty affects households as a whole, because of the\r\n              gender\r\n              division of labour and responsibilities for household welfare,\r\n              women bear a\r\n              disproportionate burden, attempting to manage household\r\n              consumption and\r\n              production under conditions of increasing scarcity.  Poverty is\r\n              particularly\r\n              acute for women living in rural households.            \n \n\n\nWomen's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process.  Poverty can also force women into situations in which\r\n              they are\r\n              vulnerable to sexual exploitation.            \n \n\n\nIn too many countries, social welfare systems do not take\r\n              sufficient\r\n              account of the specific conditions of women living in poverty,\r\n              and there is a\r\n              tendency to scale back the services provided by such systems. \r\n              The risk of\r\n              falling into poverty is greater for women than for men,\r\n              particularly in old\r\n              age, where social security systems are based on the principle of\r\n              continuous\r\n              remunerated employment.  In some cases, women do not fulfil this\r\n              requirement because of interruptions in their work, due to the unbalanced distribution of\r\n              remunerated and unremunerated work.  Moreover, older women also\r\n              face greater\r\n              obstacles to labour-market re-entry.            \n \n\n\nIn many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment.  The\r\n              proportion of women among the poor has consequently increased. \r\n              In countries\r\n              with a high level of school enrolment of girls, those who leave\r\n              the\r\n              educational system the earliest, without any qualification, are\r\n              among the most\r\n              vulnerable in the labour market.            \n \n\n\nIn countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income.            \n \n\n\nParticularly in developing countries, the productive capacity\r\n              of women\r\n              should be increased through access to capital, resources, credit,\r\n              land,\r\n              technology, information, technical assistance and training so as\r\n              to raise\r\n              their income and improve nutrition, education, health care and\r\n              status within\r\n              the household.  The release of women's productive potential is\r\n              pivotal to\r\n              breaking the cycle of poverty so that women can share fully in\r\n              the benefits of\r\n              development and in the products of their own labour.            \n \n\n\nSustainable development and economic growth that is both\r\n              sustained and\r\n              sustainable are possible only through improving the economic,\r\n              social,\r\n              political, legal and cultural status of women.  Equitable social\r\n              development\r\n              that recognizes empowering the poor, particularly women, to\r\n              utilize\r\n              environmental resources sustainably is a necessary foundation for\r\n              sustainable\r\n              development.            \n \n\n\nThe success of policies and measures aimed at supporting or\r\n              strengthening the promotion of gender equality and the                              improvement of the                                                                              status of women should be based on the integration of the gender\r\n              perspective\r\n                                                                                  in general policies relating to all spheres of society as well as\r\n              the\r\n                                               implementation of positive measures with adequate institutional and financial\r\n              support at all levels.            \n \n\n\n Go back to the top of the page \n Strategic objective A.1. \r\n          Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;                \n\n\n \n\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;                  \n \n\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;                  \n \n\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;                  \n \n\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;                  \n \n\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;                  \n \n\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;                  \n \n\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;                  \n \n\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;                  \n \n\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;                  \n \n\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;                  \n \n\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;                  \n \n\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;                  \n \n\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;                  \n \n\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;                  \n \n\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;                  \n \n\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them. \n\n\n \n\n\nBy multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:            \n \n\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;                          \n\n\n \n\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;                            \n \n\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;                            \n \n\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;                            \n \n\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;                            \n \n\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;                            \n \n\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods.                            \n \n\n\n\n\nBy national and international non-governmental organizations\r\n              and women's\r\n              groups:\r\n              \r\n                \n\n\n\n \n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;                    \n \n\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;                    \n \n\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;                    \n \n\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;                    \n \n\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;                    \n \n\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies. \n\n\n\n\n \n  Go back to the top of the page \n Strategic objective A.2. \r\n          Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;                \n\n\n \n\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;                  \n \n\n\nConsider ratification of Convention No. 169 of the\r\n                                                      International Labour\r\n                                                      Organization (ILO) as part of their efforts to promote and\r\n                                                      protect the rights of\r\n                                                      indigenous people.            \n\n\n\n\n  Go back to the top of the page \n Strategic objective A.3. \r\n          Provide women with access to savings and credit mechanisms and institutions        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;                \n\n\n \n\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women.            \n\n\n \n\n\nBy commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:            \n \n\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;                          \n\n\n \n\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;                            \n \n\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;                            \n \n\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services.            \n\n\n \n \n\n\nBy multilateral and bilateral development cooperation\r\n              organizations:            \n \n\n\n                                              Support, through the provision of capital and/or\r\n  resources,\r\n  financial institutions that serve low-income,\r\n  small-scale and\r\n  micro-scale women entrepreneurs and producers, in both\r\n  the formal\r\n  and informal sectors.                                              \n\n\n \n\n\nBy Governments and multilateral financial institutions, as\r\n              appropriate:            \n \n\n\n                                                                                      Support institutions that meet performance standards in\r\n  reaching\r\n  large numbers of low-income women and men through\r\n  capitalization,\r\n  refinancing and institutional development support in\r\n  forms that\r\n  foster self-sufficiency.                                                                                      \n\n\n \n\n\nBy international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty.                  \n\n\n\n\n  Go back to the top of the page \n Strategic objective A.4.\r\n          Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty        \n Actions to be taken \n\n\n\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:              \n\n\n\n \n\n\n Develop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;                  \n\n\n \n\n\n Apply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings.            \n\n\n \n\n\n\n\nBy national and international statistical organizations:\r\n                      \n \n\n Collect gender and age-disaggregated data on poverty and\r\n              all aspects\r\n              of economic activity and develop qualitative and\r\n              quantitative\r\n              statistical indicators to facilitate the assessment of\r\n              economic\r\n              performance from a gender perspective;            \n \n\n\n Devise suitable statistical means to recognize and make\r\n                                          visible the\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nThe United Nations\r\n          Fourth World Conference on Women\nBeijing, China - September 1995\r\n        Action for Equality, Development and Peace        \nPLATFORM FOR ACTION  \nWomen and Poverty Diagnosis \n \n\n\nStrategic objective A.1. Review, adopt and maintain macroeconomic policies and development strategies that address the needs and efforts of women in poverty. Actions to be taken.            \n\n\n Strategic objective A.2. Revise laws and administrative practices to ensure women's equal rights and access to economic resources. Actions to be taken.          \n Strategic objective A.3. Provide women with access to savings and credit mechanisms and institutions. Actions to be taken.          \n Strategic objective A.4. Develop gender-based methodologies and conduct research to address the feminization of poverty. Actions to be taken.          \n \n\nWomen and Poverty follow-up (Under construction)        \n \n  Go back to Index \n\n\n\n\n\n \nA.  Women and Poverty\n \n\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries.  Poverty has various causes, including\r\n              structural ones. \r\n              Poverty is a complex, multidimensional problem, with origins in\r\n              both the\r\n              national and international domains.  The globalization of the\r\n              world's economy\r\n              and the deepening interdependence among nations present\r\n              challenges and\r\n              opportunities for sustained economic growth and development, as\r\n              well as risks\r\n              and uncertainties for the future of the world economy.  The\r\n              uncertain global\r\n              economic climate has been accompanied by economic restructuring\r\n              as well as, in\r\n              a certain number of countries, persistent, unmanageable levels of\r\n              external\r\n              debt and structural adjustment programmes.  In addition, all\r\n              types of\r\n              conflict, displacement of people and environmental degradation\r\n              have undermined\r\n              the capacity of Governments to meet the basic needs of their\r\n              populations. \r\n              Transformations in the world economy are profoundly changing the\r\n              parameters of\r\n              social development in all countries.  One significant trend has\r\n              been the\r\n              increased poverty of women, the extent of which varies from\r\n              region to region. \r\n              The gender disparities in economic power-sharing are also an\r\n              important\r\n              contributing factor to the poverty of women.  Migration and\r\n              consequent changes\r\n              in family structures have placed additional burdens on women,\r\n              especially those\r\n              who provide for several dependants.  Macroeconomic policies need\r\n              rethinking\r\n              and reformulation to address such trends.  These policies focus\r\n              almost\r\n              exclusively on the formal sector.  They also tend to impede the\r\n              initiatives of\r\n              women and fail to consider the differential impact on women and\r\n              men.  The\r\n              application of gender analysis to a wide range of policies and\r\n              programmes is\r\n              therefore critical to poverty reduction strategies.  In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty.  The eradication of\r\n              poverty cannot\r\n              be accomplished through anti-poverty programmes alone but will\r\n              require\r\n              democratic participation and changes in economic structures in\r\n              order to ensure\r\n              access for all women to resources, opportunities and public\r\n              services.  Poverty\r\n              has various manifestations, including lack of income and\r\n              productive resources\r\n              sufficient to ensure a sustainable livelihood; hunger and\r\n              malnutrition; ill\r\n              health; limited or lack of access to education and other basic\r\n              services;\r\n              increasing morbidity and mortality from illness; homelessness and\r\n              inadequate\r\n              housing; unsafe environments; and social discrimination and\r\n              exclusion.  It is\r\n              also characterized by lack of participation in decision-making\r\n              and in civil,\r\n              social and cultural life.  It occurs in all countries - as mass\r\n              poverty in\r\n              many developing countries and as pockets of poverty amidst wealth\r\n              in developed\r\n              countries.  Poverty may be caused by an economic recession that\r\n              results in\r\n              loss of livelihood or by disaster or conflict.  There is also the\r\n              poverty of low-wage workers and the utter destitution of people who fall\r\n              outside family\r\n              support systems, social institutions and safety nets. \n\n\n \n\n\nIn the past decade the number of women living in poverty has\r\n              increased\r\n              disproportionately to the number of men, particularly in the\r\n              developing\r\n              countries.  The feminization of poverty has also recently become\r\n              a significant\r\n              problem in the countries with economies in transition as a\r\n              short-term\r\n              consequence of the process of political, economic and social\r\n              transformation. \r\n              In addition to economic factors, the rigidity of socially\r\n              ascribed gender\r\n              roles and women's limited access to power, education, training\r\n              and productive\r\n              resources as well as other emerging factors that may lead to\r\n              insecurity for\r\n              families are also responsible.  The failure to adequately\r\n              mainstream a gender\r\n              perspective in all economic analysis and planning and to address\r\n              the\r\n              structural causes of poverty is also a contributing factor.            \n \n\n\nWomen contribute to the economy and to combating poverty\r\n              through both\r\n              remunerated and unremunerated work at home, in the community and\r\n              in the\r\n              workplace.  The empowerment of women is a critical factor in the\r\n              eradication\r\n              of poverty.            \n \n\n\nWhile poverty affects households as a whole, because of the\r\n              gender\r\n              division of labour and responsibilities for household welfare,\r\n              women bear a\r\n              disproportionate burden, attempting to manage household\r\n              consumption and\r\n              production under conditions of increasing scarcity.  Poverty is\r\n              particularly\r\n              acute for women living in rural households.            \n \n\n\nWomen's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process.  Poverty can also force women into situations in which\r\n              they are\r\n              vulnerable to sexual exploitation.            \n \n\n\nIn too many countries, social welfare systems do not take\r\n              sufficient\r\n              account of the specific conditions of women living in poverty,\r\n              and there is a\r\n              tendency to scale back the services provided by such systems. \r\n              The risk of\r\n              falling into poverty is greater for women than for men,\r\n              particularly in old\r\n              age, where social security systems are based on the principle of\r\n              continuous\r\n              remunerated employment.  In some cases, women do not fulfil this\r\n              requirement because of interruptions in their work, due to the unbalanced distribution of\r\n              remunerated and unremunerated work.  Moreover, older women also\r\n              face greater\r\n              obstacles to labour-market re-entry.            \n \n\n\nIn many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment.  The\r\n              proportion of women among the poor has consequently increased. \r\n              In countries\r\n              with a high level of school enrolment of girls, those who leave\r\n              the\r\n              educational system the earliest, without any qualification, are\r\n              among the most\r\n              vulnerable in the labour market.            \n \n\n\nIn countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income.            \n \n\n\nParticularly in developing countries, the productive capacity\r\n              of women\r\n              should be increased through access to capital, resources, credit,\r\n              land,\r\n              technology, information, technical assistance and training so as\r\n              to raise\r\n              their income and improve nutrition, education, health care and\r\n              status within\r\n              the household.  The release of women's productive potential is\r\n              pivotal to\r\n              breaking the cycle of poverty so that women can share fully in\r\n              the benefits of\r\n              development and in the products of their own labour.            \n \n\n\nSustainable development and economic growth that is both\r\n              sustained and\r\n              sustainable are possible only through improving the economic,\r\n              social,\r\n              political, legal and cultural status of women.  Equitable social\r\n              development\r\n              that recognizes empowering the poor, particularly women, to\r\n              utilize\r\n              environmental resources sustainably is a necessary foundation for\r\n              sustainable\r\n              development.            \n \n\n\nThe success of policies and measures aimed at supporting or\r\n              strengthening the promotion of gender equality and the                              improvement of the                                                                              status of women should be based on the integration of the gender\r\n              perspective\r\n                                                                                  in general policies relating to all spheres of society as well as\r\n              the\r\n                                               implementation of positive measures with adequate institutional and financial\r\n              support at all levels.            \n \n\n\n Go back to the top of the page \n Strategic objective A.1. \r\n          Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;                \n\n\n \n\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;                  \n \n\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;                  \n \n\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;                  \n \n\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;                  \n \n\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;                  \n \n\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;                  \n \n\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;                  \n \n\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;                  \n \n\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;                  \n \n\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;                  \n \n\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;                  \n \n\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;                  \n \n\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;                  \n \n\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;                  \n \n\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;                  \n \n\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them. \n\n\n \n\n\nBy multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:            \n \n\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;                          \n\n\n \n\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;                            \n \n\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;                            \n \n\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;                            \n \n\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;                            \n \n\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;                            \n \n\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods.                            \n \n\n\n\n\nBy national and international non-governmental organizations\r\n              and women's\r\n              groups:\r\n              \r\n                \n\n\n\n \n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;                    \n \n\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;                    \n \n\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;                    \n \n\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;                    \n \n\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;                    \n \n\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies. \n\n\n\n\n \n  Go back to the top of the page \n Strategic objective A.2. \r\n          Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;                \n\n\n \n\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;                  \n \n\n\nConsider ratification of Convention No. 169 of the\r\n                                                      International Labour\r\n                                                      Organization (ILO) as part of their efforts to promote and\r\n                                                      protect the rights of\r\n                                                      indigenous people.            \n\n\n\n\n  Go back to the top of the page \n Strategic objective A.3. \r\n          Provide women with access to savings and credit mechanisms and institutions        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;                \n\n\n \n\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women.            \n\n\n \n\n\nBy commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:            \n \n\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;                          \n\n\n \n\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;                            \n \n\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;                            \n \n\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services.            \n\n\n \n \n\n\nBy multilateral and bilateral development cooperation\r\n              organizations:            \n \n\n\n                                              Support, through the provision of capital and/or\r\n  resources,\r\n  financial institutions that serve low-income,\r\n  small-scale and\r\n  micro-scale women entrepreneurs and producers, in both\r\n  the formal\r\n  and informal sectors.                                              \n\n\n \n\n\nBy Governments and multilateral financial institutions, as\r\n              appropriate:            \n \n\n\n                                                                                      Support institutions that meet performance standards in\r\n  reaching\r\n  large numbers of low-income women and men through\r\n  capitalization,\r\n  refinancing and institutional development support in\r\n  forms that\r\n  foster self-sufficiency.                                                                                      \n\n\n \n\n\nBy international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty.                  \n\n\n\n\n  Go back to the top of the page \n Strategic objective A.4.\r\n          Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty        \n Actions to be taken \n\n\n\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:              \n\n\n\n \n\n\n Develop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;                  \n\n\n \n\n\n Apply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings.            \n\n\n \n\n\n\n\nBy national and international statistical organizations:\n\nBeijing, China - September 1995\r\n        Action for Equality, Development and Peace\n\nPLATFORM FOR ACTION\n\nWomen and Poverty Diagnosis\n\nStrategic objective A.1. Review, adopt and maintain macroeconomic policies and development strategies that address the needs and efforts of women in poverty. Actions to be taken.\n\nStrategic objective A.2. Revise laws and administrative practices to ensure women's equal rights and access to economic resources. Actions to be taken.\n\nStrategic objective A.3. Provide women with access to savings and credit mechanisms and institutions. Actions to be taken.\n\nStrategic objective A.4. Develop gender-based methodologies and conduct research to address the feminization of poverty. Actions to be taken.\n\nWomen and Poverty follow-up (Under construction)\n\nGo back to Index\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries.  Poverty has various causes, including\r\n              structural ones. \r\n              Poverty is a complex, multidimensional problem, with origins in\r\n              both the\r\n              national and international domains.  The globalization of the\r\n              world's economy\r\n              and the deepening interdependence among nations present\r\n              challenges and\r\n              opportunities for sustained economic growth and development, as\r\n              well as risks\r\n              and uncertainties for the future of the world economy.  The\r\n              uncertain global\r\n              economic climate has been accompanied by economic restructuring\r\n              as well as, in\r\n              a certain number of countries, persistent, unmanageable levels of\r\n              external\r\n              debt and structural adjustment programmes.  In addition, all\r\n              types of\r\n              conflict, displacement of people and environmental degradation\r\n              have undermined\r\n              the capacity of Governments to meet the basic needs of their\r\n              populations. \r\n              Transformations in the world economy are profoundly changing the\r\n              parameters of\r\n              social development in all countries.  One significant trend has\r\n              been the\r\n              increased poverty of women, the extent of which varies from\r\n              region to region. \r\n              The gender disparities in economic power-sharing are also an\r\n              important\r\n              contributing factor to the poverty of women.  Migration and\r\n              consequent changes\r\n              in family structures have placed additional burdens on women,\r\n              especially those\r\n              who provide for several dependants.  Macroeconomic policies need\r\n              rethinking\r\n              and reformulation to address such trends.  These policies focus\r\n              almost\r\n              exclusively on the formal sector.  They also tend to impede the\r\n              initiatives of\r\n              women and fail to consider the differential impact on women and\r\n              men.  The\r\n              application of gender analysis to a wide range of policies and\r\n              programmes is\r\n              therefore critical to poverty reduction strategies.  In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty.  The eradication of\r\n              poverty cannot\r\n              be accomplished through anti-poverty programmes alone but will\r\n              require\r\n              democratic participation and changes in economic structures in\r\n              order to ensure\r\n              access for all women to resources, opportunities and public\r\n              services.  Poverty\r\n              has various manifestations, including lack of income and\r\n              productive resources\r\n              sufficient to ensure a sustainable livelihood; hunger and\r\n              malnutrition; ill\r\n              health; limited or lack of access to education and other basic\r\n              services;\r\n              increasing morbidity and mortality from illness; homelessness and\r\n              inadequate\r\n              housing; unsafe environments; and social discrimination and\r\n              exclusion.  It is\r\n              also characterized by lack of participation in decision-making\r\n              and in civil,\r\n              social and cultural life.  It occurs in all countries - as mass\r\n              poverty in\r\n              many developing countries and as pockets of poverty amidst wealth\r\n              in developed\r\n              countries.  Poverty may be caused by an economic recession that\r\n              results in\r\n              loss of livelihood or by disaster or conflict.  There is also the\r\n              poverty of low-wage workers and the utter destitution of people who fall\r\n              outside family\r\n              support systems, social institutions and safety nets.\n\nIn the past decade the number of women living in poverty has\r\n              increased\r\n              disproportionately to the number of men, particularly in the\r\n              developing\r\n              countries.  The feminization of poverty has also recently become\r\n              a significant\r\n              problem in the countries with economies in transition as a\r\n              short-term\r\n              consequence of the process of political, economic and social\r\n              transformation. \r\n              In addition to economic factors, the rigidity of socially\r\n              ascribed gender\r\n              roles and women's limited access to power, education, training\r\n              and productive\r\n              resources as well as other emerging factors that may lead to\r\n              insecurity for\r\n              families are also responsible.  The failure to adequately\r\n              mainstream a gender\r\n              perspective in all economic analysis and planning and to address\r\n              the\r\n              structural causes of poverty is also a contributing factor.\n\nWomen contribute to the economy and to combating poverty\r\n              through both\r\n              remunerated and unremunerated work at home, in the community and\r\n              in the\r\n              workplace.  The empowerment of women is a critical factor in the\r\n              eradication\r\n              of poverty.\n\nWhile poverty affects households as a whole, because of the\r\n              gender\r\n              division of labour and responsibilities for household welfare,\r\n              women bear a\r\n              disproportionate burden, attempting to manage household\r\n              consumption and\r\n              production under conditions of increasing scarcity.  Poverty is\r\n              particularly\r\n              acute for women living in rural households.\n\nWomen's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process.  Poverty can also force women into situations in which\r\n              they are\r\n              vulnerable to sexual exploitation.\n\nIn too many countries, social welfare systems do not take\r\n              sufficient\r\n              account of the specific conditions of women living in poverty,\r\n              and there is a\r\n              tendency to scale back the services provided by such systems. \r\n              The risk of\r\n              falling into poverty is greater for women than for men,\r\n              particularly in old\r\n              age, where social security systems are based on the principle of\r\n              continuous\r\n              remunerated employment.  In some cases, women do not fulfil this\r\n              requirement because of interruptions in their work, due to the unbalanced distribution of\r\n              remunerated and unremunerated work.  Moreover, older women also\r\n              face greater\r\n              obstacles to labour-market re-entry.\n\nIn many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment.  The\r\n              proportion of women among the poor has consequently increased. \r\n              In countries\r\n              with a high level of school enrolment of girls, those who leave\r\n              the\r\n              educational system the earliest, without any qualification, are\r\n              among the most\r\n              vulnerable in the labour market.\n\nIn countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income.\n\nParticularly in developing countries, the productive capacity\r\n              of women\r\n              should be increased through access to capital, resources, credit,\r\n              land,\r\n              technology, information, technical assistance and training so as\r\n              to raise\r\n              their income and improve nutrition, education, health care and\r\n              status within\r\n              the household.  The release of women's productive potential is\r\n              pivotal to\r\n              breaking the cycle of poverty so that women can share fully in\r\n              the benefits of\r\n              development and in the products of their own labour.\n\nSustainable development and economic growth that is both\r\n              sustained and\r\n              sustainable are possible only through improving the economic,\r\n              social,\r\n              political, legal and cultural status of women.  Equitable social\r\n              development\r\n              that recognizes empowering the poor, particularly women, to\r\n              utilize\r\n              environmental resources sustainably is a necessary foundation for\r\n              sustainable\r\n              development.\n\nThe success of policies and measures aimed at supporting or\r\n              strengthening the promotion of gender equality and the                              improvement of the                                                                              status of women should be based on the integration of the gender\r\n              perspective\r\n                                                                                  in general policies relating to all spheres of society as well as\r\n              the\r\n                                               implementation of positive measures with adequate institutional and financial\r\n              support at all levels.\n\nGo back to the top of the page\n\nStrategic objective A.1. \r\n          Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty\n\nActions to be taken\n\nBy Governments:\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them.\n\nBy multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods.\n\nBy national and international non-governmental organizations\r\n              and women's\r\n              groups:\n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies.\n\nGo back to the top of the page\n\nStrategic objective A.2. \r\n          Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources\n\nActions to be taken\n\nBy Governments:\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;\n\nConsider ratification of Convention No. 169 of the\r\n                                                      International Labour\r\n                                                      Organization (ILO) as part of their efforts to promote and\r\n                                                      protect the rights of\r\n                                                      indigenous people.\n\nGo back to the top of the page\n\nStrategic objective A.3. \r\n          Provide women with access to savings and credit mechanisms and institutions\n\nActions to be taken\n\nBy Governments:\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women.\n\nBy commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services.\n\nBy multilateral and bilateral development cooperation\r\n              organizations:\n\nSupport, through the provision of capital and/or\r\n  resources,\r\n  financial institutions that serve low-income,\r\n  small-scale and\r\n  micro-scale women entrepreneurs and producers, in both\r\n  the formal\r\n  and informal sectors.\n\nBy Governments and multilateral financial institutions, as\r\n              appropriate:\n\nSupport institutions that meet performance standards in\r\n  reaching\r\n  large numbers of low-income women and men through\r\n  capitalization,\r\n  refinancing and institutional development support in\r\n  forms that\r\n  foster self-sufficiency.\n\nBy international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty.\n\nGo back to the top of the page\n\nStrategic objective A.4.\r\n          Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty\n\nActions to be taken\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:\n\nDevelop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;\n\nApply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings.\n\nBy national and international statistical organizations:\n\nCollect gender and age-disaggregated data on poverty and\r\n              all aspects\r\n              of economic activity and develop qualitative and\r\n              quantitative\r\n              statistical indicators to facilitate the assessment of\r\n              economic\r\n              performance from a gender perspective;\n\nDevise suitable statistical means to recognize and make\r\n                                          visible the\n\nContact Us | Sitemap\n\nContact Us | Sitemap",
  "date": "",
  "source_type": "UN_organization",
  "extracted_at": "2025-04-07T13:48:45.049952",
  "metadata": {},
  "relevance_score": 0.675,
  "summary": "Home | Contact Us\n\nAbout\r\n          us\n\nAbout\r\n          us\n\nBeijing and \r\n          its Follow-up\n\nCSW\n\nECOSOC\n\nGeneral Assembly\n\nExpert Group\r\n          Meetings\n\nViolence against\r\n            Women\n\nViolence against\r\n            Women\n\nPublications\n\nNGO Participation\n\nTechnical Cooperation\n\nFirst World Conference\nSecond World Conference\nThird World Conference\n\nFourth World Conference\n\n\nBeijing Declaration \n Platform For Action \nOfficial Documents \nStatements By Governments \nStatements by United Nations and Inter-governmental Organizations Statements by Non-governmental Organizations \nThe Platform for Action, DPI Brochure \nPhoto Gallery \n\n\n\n\nFive-year Review and Appraisal \n\n\nBeijing+5 and beyond \nDocuments \nSummaries of panel discussions \nResponses to  Questionnaire \nPress kit\nPre-session briefing\nProgramme of Activities\nNGO participation\n\n\n\n\nTen-year Review and Appraisal  \n\n\nOverview\n\nDraft Provisional Agenda\nOfficial Documents\nResolutions\nStatements\nHigh-Level Events\nNGO Participation\nSide/Parallel Events\nQuestionnaire to Member States\nResponses\nExpert Group Meetings \nRegional Processes\nRelevant Links\nBeijing at Ten and Beyond\n\n\nFifteen-year Review and Appraisal  \n\n\nNational level review of implementation\n\nQuestionnaire\nMember States responses\n\n\nRegional 15-year review processes\n \nRegional reports\nRegional meetings\n\nGlobal 15-year review process in the 54th session of the Commission on the Status of Women\n \nOverview\nDocumentation\nInteractive events\nOutcome\nParticipation\n\nCommemoration of the 15th anniversary by the General Assembly\nRelated intergovernmental processes\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty \n\n\nThe United Nations\r\n          Fourth World Conference on Women\nBeijing, China - September 1995\r\n        Action for Equality, Development and Peace        \nPLATFORM FOR ACTION  \nWomen and Poverty Diagnosis \n \n\n\nStrategic objective A.1. Women and Poverty\n \n\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries. In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty. The eradication of\r\n              poverty cannot\r\n              be accomplished through anti-poverty programmes alone but will\r\n              require\r\n              democratic participation and changes in economic structures in\r\n              order to ensure\r\n              access for all women to resources, opportunities and public\r\n              services. Women's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process. In many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment. In countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income. Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;                \n\n\n \n\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;                  \n \n\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;                  \n \n\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;                  \n \n\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;                  \n \n\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;                  \n \n\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;                  \n \n\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;                  \n \n\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;                  \n \n\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;                  \n \n\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;                  \n \n\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;                  \n \n\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;                  \n \n\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;                  \n \n\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;                  \n \n\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;                  \n \n\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them. By multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:            \n \n\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;                          \n\n\n \n\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;                            \n \n\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;                            \n \n\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;                            \n \n\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;                            \n \n\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;                            \n \n\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods. By national and international non-governmental organizations\r\n              and women's\r\n              groups:\r\n              \r\n                \n\n\n\n \n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;                    \n \n\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;                    \n \n\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;                    \n \n\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;                    \n \n\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;                    \n \n\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies. Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;                \n\n\n \n\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;                  \n \n\n\nConsider ratification of Convention No. Provide women with access to savings and credit mechanisms and institutions        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;                \n\n\n \n\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women. By commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:            \n \n\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;                          \n\n\n \n\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;                            \n \n\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;                            \n \n\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services. By international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty. Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty        \n Actions to be taken \n\n\n\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:              \n\n\n\n \n\n\n Develop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;                  \n\n\n \n\n\n Apply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings. By national and international statistical organizations:\r\n                      \n \n\n Collect gender and age-disaggregated data on poverty and\r\n              all aspects\r\n              of economic activity and develop qualitative and\r\n              quantitative\r\n              statistical indicators to facilitate the assessment of\r\n              economic\r\n              performance from a gender perspective;            \n \n\n\n Devise suitable statistical means to recognize and make\r\n                                          visible the\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nBeijing and its Follow-up                \r\n        > Platform for action       \r\n        > Women and poverty\n\nThe United Nations\r\n          Fourth World Conference on Women\nBeijing, China - September 1995\r\n        Action for Equality, Development and Peace        \nPLATFORM FOR ACTION  \nWomen and Poverty Diagnosis \n \n\n\nStrategic objective A.1. Women and Poverty\n \n\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries. In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty. The eradication of\r\n              poverty cannot\r\n              be accomplished through anti-poverty programmes alone but will\r\n              require\r\n              democratic participation and changes in economic structures in\r\n              order to ensure\r\n              access for all women to resources, opportunities and public\r\n              services. Women's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process. In many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment. In countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income. Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;                \n\n\n \n\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;                  \n \n\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;                  \n \n\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;                  \n \n\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;                  \n \n\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;                  \n \n\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;                  \n \n\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;                  \n \n\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;                  \n \n\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;                  \n \n\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;                  \n \n\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;                  \n \n\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;                  \n \n\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;                  \n \n\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;                  \n \n\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;                  \n \n\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them. By multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:            \n \n\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;                          \n\n\n \n\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;                            \n \n\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;                            \n \n\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;                            \n \n\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;                            \n \n\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;                            \n \n\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods. By national and international non-governmental organizations\r\n              and women's\r\n              groups:\r\n              \r\n                \n\n\n\n \n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;                    \n \n\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;                    \n \n\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;                    \n \n\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;                    \n \n\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;                    \n \n\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies. Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;                \n\n\n \n\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;                  \n \n\n\nConsider ratification of Convention No. Provide women with access to savings and credit mechanisms and institutions        \n Actions to be taken \n\n\n\nBy Governments:            \n\n\n \n\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;                \n\n\n \n\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women. By commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:            \n \n\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;                          \n\n\n \n\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;                            \n \n\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;                            \n \n\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services. By international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty. Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty        \n Actions to be taken \n\n\n\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:              \n\n\n\n \n\n\n Develop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;                  \n\n\n \n\n\n Apply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings. Women and Poverty follow-up (Under construction)\n\nGo back to Index\n\nMore than 1 billion people in the world today, the great\r\n              majority of\r\n              whom are women, live in unacceptable conditions of poverty,\r\n              mostly in the\r\n              developing countries. In order to\r\n              eradicate\r\n              poverty and achieve sustainable development, women and men must\r\n              participate\r\n              fully and equally in the formulation of macroeconomic and social\r\n              policies and\r\n              strategies for the eradication of poverty. Women's poverty is directly related to the absence of\r\n              economic\r\n              opportunities and autonomy, lack of access to economic resources,\r\n              including\r\n              credit, land ownership and inheritance, lack of access to\r\n              education and\r\n              support services and their minimal participation in the\r\n              decision-making\r\n              process. In many developed countries, where the level of general\r\n              education and\r\n              professional training of women and men are similar and where\r\n              systems of\r\n              protection against discrimination are available, in some sectors\r\n              the economic\r\n              transformations of the past decade have strongly increased either\r\n              the\r\n              unemployment of women or the precarious nature of their\r\n              employment. In countries with economies in transition and in other\r\n              countries\r\n              undergoing fundamental political, economic and social\r\n              transformations, these                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               transformations have often led to a reduction in women's income\r\n              or to women\r\n              being deprived of income. Review, adopt and maintain macroeconomic policies and\r\n          development strategies that address the needs and efforts of\r\n          women in poverty\n\nActions to be taken\n\nBy Governments:\n\nReview and modify, with the full and equal participation of\r\n                  women,\r\n                  macroeconomic and social policies with a view to achieving the\r\n                  objectives of the\r\n                  Platform for Action;\n\nAnalyse, from a gender perspective, policies and programmes -\r\n                    including those\r\n                    related to macroeconomic stability, structural adjustment,\r\n                    external debt problems,\r\n                    taxation, investments, employment, markets and all relevant\r\n                    sectors of the economy\r\n                    - with respect to their impact on poverty, on inequality and\r\n                    particularly on\r\n                    women; assess their impact on family well-being and conditions\r\n                    and adjust them,\r\n                    as appropriate, to promote more equitable distribution of\r\n                    productive assets,\r\n                    wealth, opportunities, income and services;\n\nPursue and implement sound and stable macroeconomic and\r\n                    sectoral policies that\r\n                    are designed and monitored with the full and equal participation\r\n                    of women,\r\n                    encourage broad-based sustained economic growth, address the\r\n                    structural causes of\r\n                    poverty and are geared towards eradicating poverty and reducing\r\n                    gender-based\r\n                    inequality within the overall framework of achieving\r\n                    people-centred sustainable\r\n                    development;\n\nRestructure and target the allocation of public expenditures\r\n                    to promote\r\n                    women's economic opportunities and equal access to productive\r\n                    resources and to\r\n                    address the basic social, educational and health needs of women,\r\n                    particularly\r\n                    those living in poverty;\n\nDevelop agricultural and fishing sectors, where and as\r\n                    necessary, in order to\r\n                    ensure, as appropriate, household and national food security and\r\n                    food\r\n                    self-sufficiency, by allocating the necessary financial,\r\n                    technical and human\r\n                    resources;\n\nDevelop policies and programmes to promote equitable\r\n                    distribution of food\r\n                    within the household;\n\nProvide adequate safety nets and strengthen State-based and\r\n                    community-based\r\n                    support systems, as an integral part of social policy, in order\r\n                    to enable women\r\n                    living in poverty to withstand adverse economic environments and\r\n                    preserve their\r\n                    livelihood, assets and revenues in times of crisis;\n\nGenerate economic policies that have a positive impact on the\r\n                    employment and\r\n                    income of women workers in both the formal and informal sectors and adopt specific                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     measures to address women's unemployment, in particular their\r\n                    long-term unemployment;\n\nFormulate and implement, when necessary, specific economic,\r\n                    social,\r\n                    agricultural and related policies in support of female-headed\r\n                    households;\n\nDevelop and implement anti-poverty programmes, including\r\n                    employment schemes,\r\n                    that improve access to food for women living in poverty,\r\n                    including through the use of appropriate pricing and distribution mechanisms;\n\nEnsure the full realization of the human rights of all women\r\n                    migrants,\r\n                    including women migrant workers, and their protection against\r\n                    violence and\r\n                    exploitation; introduce measures for the empowerment of\r\n                    documented women migrants,\r\n                    including women migrant workers; facilitate the productive\r\n                    employment of\r\n                    documented migrant women through greater recognition of their\r\n                    skills, foreign\r\n                    education and credentials, and facilitate their full integration\r\n                    into the labour\r\n                    force;\n\nIntroduce measures to integrate or reintegrate women living\r\n                    in poverty and\r\n                    socially marginalized women into productive employment and the\r\n                    economic\r\n                    mainstream; ensure that internally displaced women have full\r\n                    access to economic\r\n                    opportunities and that the qualifications and skills of immigrant\r\n                    and refugee\r\n                    women are recognized;\n\nEnable women to obtain affordable housing and access to land\r\n                    by, among other\r\n                    things, removing all obstacles to access, with special emphasis\r\n                    on meeting the\r\n                    needs of women, especially those living in poverty and female\r\n                    heads of household;\n\nFormulate and implement policies and programmes that enhance\r\n                    the access of\r\n                    women agricultural and fisheries producers (including subsistence\r\n                    farmers and\r\n                    producers, especially in rural areas) to financial, technical,\r\n                    extension and\r\n                    marketing services; provide access to and control of land,\r\n                    appropriate\r\n                    infrastructure and technology in order to increase women's\r\n                    incomes and promote\r\n                    household food security, especially in rural areas and, where\r\n                    appropriate,\r\n                    encourage the development of producer-owned, market-based\r\n                    cooperatives;\n\nCreate social security systems wherever they do not exist, or\r\n                    review them with a view to placing individual women and men on an equal footing, at every stage of their lives;\n\nEnsure access to free or low-cost legal services, including\r\n                    legal literacy,\r\n                    especially designed to reach women living in poverty;\n\nTake particular measures to promote and strengthen policies\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        and programmes for  indigenous women with their full participation and respect for                                                                  their cultural\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        diversity, so that they have opportunities and the possibility of\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    choice in the\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        development process in order to eradicate the poverty that affects them. By multilateral financial and development institutions,\r\n              including the World\r\n              Bank, the International Monetary Fund and regional development\r\n              institutions, and\r\n              through bilateral development cooperation:\n\nIn accordance with the commitments made at the World Summit\r\n                            for Social\r\n                            Development, seek to mobilize new and additional financial\r\n                            resources that are both\r\n                            adequate and predictable and mobilized in a way that maximizes\r\n                            the availability\r\n                            of such resources and uses all available funding sources and\r\n                            mechanisms with a\r\n                            view to contributing towards the goal of poverty eradication and\r\n                            targeting women\r\n                            living in poverty;\n\nStrengthen analytical capacity in order to more\r\n                              systematically strengthen\r\n                              gender perspectives and integrate them into the design and\r\n                              implementation of\r\n                              lending programmes, including structural adjustment and economic\r\n                              recovery\r\n                              programmes;\n\nFind effective development-oriented and durable solutions to\r\n                              external debt\r\n                              problems in order to help them to finance programmes and projects\r\n                              targeted at\r\n                              development, including the advancement of women, inter alia,\r\n                              through the immediate\r\n                              implementation of the terms of debt forgiveness agreed upon in\r\n                              the Paris Club in\r\n                              December 1994, which encompassed debt reduction, including\r\n                              cancellation or other\r\n                              debt relief measures and develop techniques of debt conversion\r\n                              applied to social\r\n                              development programmes and projects in conformity with the\r\n                              priorities of the\r\n                              Platform for Action;\n\nInvite the international financial institutions to examine\r\n                              innovative\r\n                              approaches to assisting low-income countries with a high\r\n                              proportion of\r\n                              multilateral debt, with a view to alleviating their debt burden;\n\nEnsure that structural adjustment programmes are designed to\r\n                              minimize their\r\n                              negative effects on vulnerable and disadvantaged groups and\r\n                              communities and to\r\n                              assure their positive effects on such groups and communities by\r\n                              preventing their\r\n                              marginalization in economic and social activities and devising\r\n                              measures to ensure\r\n                              that they gain access to and control over economic resources and\r\n                              economic and\r\n                              social activities; take actions to reduce inequality and economic disparity;\n\nReview the impact of structural adjustment programmes on\r\n                              social development\r\n                              by means of gender-sensitive social impact assessments and other\r\n                              relevant methods,\r\n                              in order to develop policies to reduce their negative effects and\r\n                              improve their                                                                                                     positive impact, ensuring that women do not bear a\r\n                              disproportionate burden of\r\n                              transition costs; complement adjustment lending with enhanced,\r\n                              targeted social\r\n                              development lending;\n\nCreate an enabling environment that allows women to build and\r\n                              maintain\r\n                              sustainable livelihoods. By national and international non-governmental organizations\r\n              and women's\r\n              groups:\n\nMobilize all parties involved in the development process,\r\n                      including academic\r\n                      institutions, non-governmental organizations and grass-roots and\r\n                      women's groups,\r\n                      to improve the effectiveness of anti-poverty programmes directed\r\n                      towards the\r\n                      poorest and most disadvantaged groups of women, such as rural and\r\n                      indigenous\r\n                      women, female heads of household, young women and older women,\r\n                      refugees and\r\n                      migrant women and women with disabilities, recognizing that\r\n                      social\r\n                      development is primarily the responsibility of Governments;\n\nEngage in lobbying and establish monitoring mechanisms, as\r\n                      appropriate, and\r\n                      other relevant activities to ensure implementation of the\r\n                      recommendations on\r\n                      poverty eradication outlined in the Platform for Action and aimed\r\n                      at ensuring\r\n                      accountability and transparency from the State and private\r\n                      sectors;\n\nInclude in their activities women with diverse needs and\r\n                      recognize that youth\r\n                      organizations are increasingly becoming effective partners in\r\n                      development\r\n                      programmes;\n\nIn cooperation with the government and private sectors,\r\n                      participate in the\r\n                      development of a comprehensive national strategy for improving\r\n                      health, education\r\n                      and social services so that girls and women of all ages living in\r\n                      poverty have\r\n                      full access to such services; seek funding to secure access to\r\n                      services with a\r\n                      gender perspective and to extend those services in order to reach\r\n                      the rural and\r\n                      remote areas that are not covered by government institutions;\n\nIn cooperation with Governments, employers, other social\r\n                      partners and relevant\r\n                      parties, contribute to the development of education and training\r\n                      and retraining\r\n                      policies to ensure that women can acquire a wide range of skills\r\n                      to meet new\r\n                      demands;\n\nMobilize to protect women's right to full and equal access to\r\n                      economic\r\n                      resources, including the right to inheritance and to ownership of\r\n                      land and other\r\n                      property, credit, natural resources and appropriate technologies. Revise laws and administrative\r\n          practices to ensure women's equal rights and access to economic resources\n\nActions to be taken\n\nBy Governments:\n\nEnsure access to free or low-cost legal services, including\r\n                  legal literacy,\r\n                  especially designed to reach women living in poverty;\n\nUndertake legislative and administrative reforms to give\r\n                    women full and equal\r\n                    access to economic resources, including the right to inheritance\r\n                    and to ownership\r\n                    of land and other property, credit, natural resources and\r\n                    appropriate\r\n                    technologies;\n\nConsider ratification of Convention No. Provide women with access to savings and credit mechanisms and institutions\n\nActions to be taken\n\nBy Governments:\n\nEnhance the access of disadvantaged women, including women\r\n                  entrepreneurs, in\r\n                  rural, remote and urban areas to financial services through\r\n                  strengthening links\r\n                  between the formal banks and intermediary lending organizations,\r\n                  including\r\n                  legislative support, training for women and institutional\r\n                  strengthening for\r\n                  intermediary institutions with a view to mobilizing capital for\r\n                  those institutions\r\n                  and increasing the availability of credit;\n\nEncourage links between financial institutions and\r\n                              non-governmental\r\n                              organizations and support innovative lending practices, including\r\n                              those that\r\n                              integrate credit with women's services and training and provide\r\n                              credit facilities\r\n                              to rural women. By commercial banks, specialized financial institutions and\r\n              the private\r\n              sector in examining their policies:\n\nUse credit and savings methodologies that are effective in\r\n                            reaching women in\r\n                            poverty and innovative in reducing transaction costs and\r\n                            redefining risk;\n\nOpen special windows for lending to women, including young\r\n                              women, who lack\r\n                              access to traditional sources of collateral;\n\nSimplify banking practices, for example by reducing the\r\n                              minimum deposit and\r\n                              other requirements for opening bank accounts;\n\nEnsure the participation and joint ownership, where possible,\r\n                                                                                                                                                                                      of women clients\r\n                                                                                                                                                                                      in the decision-making of institutions providing credit and\r\n                                                                                                                                                                                      financial services. By international organizations:\r\n              \r\n                \n\n                  Increase funding for programmes and projects designed to\r\n    promote\r\n    sustainable and productive entrepreneurial activities\r\n    for income-\r\n    generation among disadvantaged women and women living in\r\n    poverty. Develop gender-based methodologies\r\n          and conduct research to address the feminization of poverty\n\nActions to be taken\n\nBy Governments, intergovernmental organizations, academic and\r\n                research\r\n                institutions and the private sector:\n\nDevelop conceptual and practical methodologies for\r\n                    incorporating\r\n                    gender perspectives into all aspects of economic\r\n                    policy-making,\r\n                    including structural adjustment planning and programmes;\n\nApply these methodologies in conducting gender-impact\r\n                              analyses of\r\n                              all policies and programmes, including structural\r\n                              adjustment\r\n                              programmes, and disseminate the research findings.",
  "entities": {
    "countries": [
      "china"
    ],
    "organizations": [
      "united nations",
      "un",
      "who"
    ],
    "key_issues": [
      "problem",
      "challenge",
      "crisis",
      "situation",
      "nation",
      "state",
      "government",
      "region",
      "solution",
      "resolution",
      "approach",
      "strategy",
      "policy",
      "initiative",
      "program",
      "action",
      "origin",
      "development",
      "human rights",
      "assistance",
      "relief",
      "welfare",
      "economic",
      "economy",
      "financial",
      "market",
      "investment",
      "united nations",
      "un",
      "general assembly",
      "ngo",
      "non-governmental organization",
      "organization",
      "foundation"
    ]
  },
  "committee": "Third Committee",
  "topic": "Fostering the advancement of women within education"
}