{
  "url": "https://peacekeeping.un.org/en/action-for-peacekeeping-a4p",
  "title": "Action for Peacekeeping (A4P) | United Nations Peacekeeping",
  "text": "Skip to main content\n\nWelcome to the United Nations\n\n\nToggle navigation\n\n\n\n\nLanguage:\n\n\n\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nWelcome to the United Nations\n\n\nToggle navigation\n\n\n\n\nLanguage:\n\n\n\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nLanguage:\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nHome\nWhat is peacekeeping\nReforming peacekeeping\nAction for Peacekeeping (A4P)\n\n\n\n\nAction for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nAction for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nAction for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence.\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence.\n\nPeacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nPeacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nPeacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\nVisit our A4P introduction website.\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.   \nDeclaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\nImplementation of Shared Commitments\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\nSee A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\nEndorsements of the Declaration\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\nHow to use the map\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\nHigh-level Meeting on Action for Peacekeeping\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n \nThematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\nPeacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\nPerformance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives. \nSee A4P Key Achievements on Performance \nPeople\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\nPartnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\nPolitics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nPeacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in several environments are causing a rise in fatalities and injuries of peacekeepers, and missions have sometimes lacked the personnel and equipment to meet these threats. Peacekeeping operations have also faced challenges in delivering on protection mandates and in contributing to long-term, sustainable peace, and in achieving coherence with other actors operating in the same contexts.\n\nTo respond to these challenges, the Secretary-General launched Action for Peacekeeping (A4P) on 28 March 2018 to renew mutual political commitment to peacekeeping operations. The Secretary-General called on Member States to join him in developing a set of mutually-agreed principles and commitments to create peacekeeping operations fit for the future. On 25 September 2018, the Secretary-General hosted a GA73 High-level meeting on Action for Peacekeeping (A4P) which brought the international community together in pursuit of these goals.\n\nVisit our A4P introduction website.\n\nOn 21 March, a high-level event co-hosted by the Kingdom of the Netherlands and the UN Secretariat marked the third anniversary of A4P.  The event introduced   Action for Peacekeeping +,  the implementation strategy of A4P for 2021-2023.\n\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. The Declaration reflects the commitments that Member States, the Secretariat and international and regional organisations have indicated they could make during extensive consultations held in June and July 2018 in New York. The commitments represent collective action to strengthen peacekeeping.\n\nThe Declaration of Shared Commitments has reached over 150 endorsements and provides a shared roadmap for strengthening peacekeeping. Success depends on Member States and the UN Secretariat working actively to implement their commitments.\n\nWe, in the Secretariat, are implementing our Declaration commitments by focusing on a set of key priorities that build on both new commitments and existing workstreams. Implementation goals are centred on eight priority commitment areas:\n\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. A tracking system is in development so that progress can be systematically monitored and reviewed.\n\nSee A4P Highlights of Key Achievements\n\nSee A4P Key Achievements on Performance\n\nSee A4P Implementation in HQ and Field Missions\n\nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. To see the survey results, click here.\n\nWe’re pleased to announce that the following countries have endorsed the Declaration of Shared Commitments on Peacekeeping Operations (as of January 2022).\n\nProduced by UNGSC/SGITT/CSDS\n\nHow to use the map\n\nHover over the map to see the tool box in the upper left corner.1. To view a specific country, click on the magnifier icon on the top, type the country name, and then click on the square button next to the search box.2. To zoom in/out the map, click on +/-.3. To go back to the default view, click on the ‘house’ icon which is the third tool in the vertical tool box.4. To move the map horizontally to view more of the map, click on the last icon ‘arrow’ in the tool box, and select the pan icon (second to the left) in the expanded menu.\n\nThe Action for Peacekeeping (A4P) High-level Meeting on 25 September was chaired by the Secretary-General. Over 100 Member States and several regional and international organizations were in attendance, including many at the highest levels. This High-level Meeting brought all partners together to demonstrate peacekeeping’s successes, acknowledge our challenges, and spur the action needed by all peacekeeping stakeholders to enable our missions to bring lasting peace to the countries in which we are mandated to serve. We are heartened by the enthusiastic support of the majority of Member States, as well as four international and regional organizations, to the Declaration of Shared Commitments.\n\nOpening remarks by the Secretary-General were followed by statements from 48 Member States and three supporting organisations. The event served as a critical stepping-stone towards implementation by all the Secretariat, Security Council members, financial-, troop-, and police-contributors, host countries and regional organizations. The public was able to watch live via UN webcast.\n\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. The following brief summaries are non-exhaustive and non-official.\n\nPeacebuilding\n\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. They stressed the need to ensure continuity of peacebuilding tasks during peacekeeping transitions and drawdown; the role of women and youth in peacebuilding; the importance of institution-building particularly the role of police, justice and corrections.\n\nPerformance\n\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. They emphasized that performance included support, equipment, training, mindset, clarity of political vision and mandate, and more, and should be viewed in terms of impact on protection of civilians, safety and security of peacekeepers, and implementation of all mandated tasks. The Importance of developing a comprehensive performance framework, and of accountability was a key theme in the discussion. Member states also discussed caveats and how to address shortfalls in equipment and training, and stressed the need for partnerships and capacity building initiatives.\n\nSee A4P Key Achievements on Performance\n\nPeople\n\nStates brought forth various perspectives on the protection of civilians, including the importance of a whole-of-mission approach; the development of tailored responses to threat profiles; and the need to match mandates with adequate resources. Several speakers underscored that State bears the primary responsibility for the protection of civilians and highlighted the importance of their accountability, and the role of national level institutions playing their role in this regard. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. There was a call for fact-based public human rights reporting in peacekeeping operations and positive feedback on the work of human rights and justice components. Member States encouraged more extensive environmental management within operations as an integral part of mission planning from the outset. They supported the UN’s victim-centered approach on sexual exploitation and abuse; called for implementation of the Secretary-General's zero tolerance policy; and stressed the need for accountability for acts of SEA committed by both uniformed and civilian personnel.\n\nPartnerships\n\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. At the operational level, commitment to funding for regional and sub-regional peace operations was raised by many Member States, with other parameters such as transparency, human rights and accountability to be taken into account. There was discussion of the question of financing of AU-led peace support operations. On policy development, Member States raised the need to share lessons learnt and to enhance complementarity. Strategic force generation, capacity building and training were crucial, including the implementation of the light coordination mechanism and language training. On information sharing, he noted that there was a call for commitment to share early warning and analysis between the UN, regional and sub-regional organizations, as well as to recognize the comparative advantages of partners. Partnerships should also be expanded to cooperation with other organizations.\n\nPolitics\n\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Member States called for better sequenced, streamlined and prioritized mandates that nevertheless preserve protection and human rights responsibilities, with an enhanced linkage between mandate preparation and resourcing decisions. Member States called for SRSGs be empowered to as a key political player in mission settings. They called for stronger linkages between the political and peacebuilding aspects of mandates, in particular during transition and drawdown periods as well as stronger linkages between the PBC and the Security Council, including regarding the formulation of mission mandates. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. There were several calls for the Secretariat to be more honest and clear in its reports to the Council in providing an assessment when mandated activities were not sufficiently resourced. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.\n\nFind us on Facebook  Find us on Twitter  Find us on YouTube  Find us on Flickr  Find us on Tumblr  Find us on Instagram  RSS feed\n\nFind us on Facebook  Find us on Twitter  Find us on YouTube  Find us on Flickr  Find us on Tumblr  Find us on Instagram  RSS feed\n\nFind us on Facebook  Find us on Twitter  Find us on YouTube  Find us on Flickr  Find us on Tumblr  Find us on Instagram  RSS feed\n\nFind us on Facebook  Find us on Twitter  Find us on YouTube  Find us on Flickr  Find us on Tumblr  Find us on Instagram  RSS feed",
  "date": "",
  "source_type": "UN_organization",
  "extracted_at": "2025-04-07T13:53:28.662405",
  "metadata": {
    "description": "Peacekeeping is one of the most effective tools available to the United Nations in the promotion and maintenance of international peace and security. Yet peacekeeping faces several challenges that undermine its ability to deliver on its mandates. Political solutions are often absent, and missions seem to have mandates that lack focus and clear priorities. Complex threats in",
    "keywords": "https://peacekeeping.un.org/sites/default/files/a4p_photo_unifil_2.jpg",
    "og:site_name": "United Nations Peacekeeping",
    "og:type": "article"
  },
  "relevance_score": 0.4,
  "summary": "Skip to main content\n\nWelcome to the United Nations\n\n\nToggle navigation\n\n\n\n\nLanguage:\n\n\n\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nWelcome to the United Nations\n\n\nToggle navigation\n\n\n\n\nLanguage:\n\n\n\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nLanguage:\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nالعربية\n中文\nEnglish\nFrançais\nРусский\nEspañol\n\nHome\nWhat is peacekeeping\nReforming peacekeeping\nAction for Peacekeeping (A4P)\n\n\n\n\nAction for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Action for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Action for Peacekeeping (A4P)\n\n\n\n\n\n\n\n\nThrough his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Through his Action for Peacekeeping (A4P) initiative, the Secretary-General called on Member States, the Security Council, host countries, troop- and police- contributing countries, regional partners and financial contributors to renew our collective engagement with UN peacekeeping and mutually commit to reach for excellence. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Declaration of Shared Commitments\nThe Secretary-General shared the Declaration of Shared Commitments on 16 August and invited Member States and relevant international and regional organisations to endorse it. Implementation goals are centred on eight priority commitment areas:\npolitics\nwomen, peace and security\nprotection\nsafety and security\nperformance and accountability\npeacebuilding and sustaining peace\npartnerships\nconduct of peacekeepers and peacekeeping operations\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\nSee A4P Key Achievements on Performance \nSee A4P Implementation in HQ and Field Missions \nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Thematic Consultations\nFive thematic consultations took place in June, at which Member States and Regional Organizations put forward proposals for mutual commitments that could strengthen peacekeeping. Peacebuilding\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts. Implementation goals are centred on eight priority commitment areas:\n\nThese eight priority commitment areas are anchored in ongoing areas of work, including the Gender Parity Strategy; the Women, Peace and Security Agenda; Santos Cruz Action Plan; Management Reform; Police Strategic Guidance Framework; Strategic Force Generation; the United Nations/African Union Joint Framework and Declaration; the Triangular Partnership Project; the Voluntary Compact on the commitment to eliminate sexual exploitation and abuse; the Human Rights Due Diligence Policy and the Environment Strategy. See A4P Highlights of Key Achievements\n\nSee A4P Key Achievements on Performance\n\nSee A4P Implementation in HQ and Field Missions\n\nIn August 2019, the UN Department of Peace Operations carried out a survey to gather perceptions of progress in A4P implementation, and register concrete actions taken by UN Peacekeeping stakeholders to implement the 45 commitments in the A4P Declaration. Peacebuilding\n\nMember States raised the need for coherence in relation to peacebuilding, among the Security Council and the Peacebuilding Commission as well as between the UN and external actors such as regional and sub-regional organizations, host countries, and international financial institutions. Performance\n\nMember States emphasized that performance had to be discussed in relation to all mission components, and also in relation to all peacekeeping stakeholders, from personnel on the ground and Headquarters, to the Security Council and troop-contributing countries. Member States underscored the need for specific gender, women protection and child protection expertise in peacekeeping operations; gender-sensitive analysis and strategies to inform decision-making; and the implementation of the Women and Peace and Security agenda by peacekeeping operations and host governments. Partnerships\n\nMember States had specified commitments at the strategic level to include enhanced cooperation between the Security Council and the AU Peace and Security Architecture. Politics\n\nSeveral Members States called for a more strategic and coherent role for the Security Council; for the Council to make better use of the tools at its disposal for supporting political processes; and for Security Council members to support Security Council actions through their individual actions, including development, trade and military policies. Regarding the role of host governments, Member States recognized the primacy of this role, but also the need for host governments to commit to support peacekeeping operations with their consent and cooperation – while also including host nations in occasional closed consultations and more systematic work by the Council and the Secretariat with host states to address host state responsibility for mandate implementation. Member States called for further improvement in triangular consultations involving the Security Council, T/PCCs and the Secretariat, and for for the Secretariat to provide better early warning, improve coherence of political efforts, support the Secretary-General’s surge in mediation efforts, improve linkages across the pillars of the UN, and provide frank options, advice and analysis and honest assessments of country situations to the Security Council. Member States encouraged greater cooperation between the Security Council, Secretariat and regional and sub-regional organizations to ensure consistent and effective horizon scanning and early warning efforts.",
  "entities": {
    "countries": [],
    "organizations": [
      "united nations",
      "un",
      "who"
    ],
    "key_issues": [
      "challenge",
      "situation",
      "country",
      "nation",
      "state",
      "government",
      "region",
      "solution",
      "approach",
      "strategy",
      "policy",
      "initiative",
      "action",
      "context",
      "development",
      "human rights",
      "financial",
      "trade",
      "united nations",
      "un",
      "security council",
      "ngo",
      "organization"
    ]
  },
  "committee": "Fourth Committee",
  "topic": "Ensuring the rights and safety of indigenous populations"
}