{
  "url": "https://www.theguardian.com/business/live/2025/mar/12/trump-tariffs-steel-aluminium-aluminum-global-europe-business-live",
  "title": "Trump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened | Trump tariffs | The Guardian",
  "text": "Business liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happenedBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShareKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this contentMost viewedMost viewed\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nUpdated 12 Mar 2025\n\nUpdated 12 Mar 2025\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDT\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDT\n\nJulia Kollewe and Kate Lamb (earlier)\n\nShare\n\nShare\n\nKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\nKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\nKey events\n\n12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\n12 Mar 2025\n\nClosing summary\n\n12 Mar 2025\n\nCanada to impose 25% tariffs on nearly $30bn in US imports\n\n12 Mar 2025\n\nStarmer: Negotiating economic deal with US, but 'will keep all options on the table'\n\n12 Mar 2025\n\nCanada to hit back with $20bn of counter-tariffs – AP\n\n12 Mar 2025\n\nBank of Canada cuts interest rates, citing trade tensions and US tariffs\n\n12 Mar 2025\n\nCooling US inflation sparks (limited) relief rally on Wall Street\n\n12 Mar 2025\n\nUS inflation dips more than expected to 2.8%\n\n12 Mar 2025\n\nEU official uses 'stinking fish' analogy for negotiations\n\n12 Mar 2025\n\n'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions\n\n12 Mar 2025\n\n'I feel utter anger': a movement to boycott US goods is spreading\n\n12 Mar 2025\n\nGermany, Ireland and Italy likely to be hit hardest by US tariffs\n\n12 Mar 2025\n\nEC president announces EU countermeasures to US tariffs from April\n\n12 Mar 2025\n\nECB chief warns trade, defence shocks could lead to persistent inflation\n\n12 Mar 2025\n\nTrump tariffs cover household goods e.g. tin foil\n\n12 Mar 2025\n\nEuropean stock markets rise amid hopes of ceasefire in Ukraine; dollar gains\n\n12 Mar 2025\n\nCommunity Union: Tariffs 'hugely damaging and threaten jobs'\n\n12 Mar 2025\n\nUnite: UK-produced steel should be designated critical national infrastructure\n\n12 Mar 2025\n\nTreasury minister: UK reserves right to retaliate but will be 'pragmatic'\n\n12 Mar 2025\n\nUK Steel: Tariffs will have 'hugely damaging consequnces'\n\n12 Mar 2025\n\nMore on Europe’s tariff countermeasures\n\n12 Mar 2025\n\nTariffs 'disappointing' says UK's trade secretary\n\n12 Mar 2025\n\nUS tariffs a 'dog act', says Australia's industry minister\n\n12 Mar 2025\n\nEU provides timing of tariff countermeasures\n\n12 Mar 2025\n\nOpening summary\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this contentMost viewedMost viewed\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\nShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nShow key events onlyPlease turn on JavaScript to use this feature\n\nPlease turn on JavaScript to use this feature\n\nFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\n\nFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nFrom 12 Mar 2025\n\nFrom 12 Mar 2025\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\nThe European Union must act to protect consumers and business.\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\nIn the meantime, we will always remain open to negotiations.\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning.\n\nAs of this morning, the United States is applying a 25% tariff on imports of steel and aluminium. We deeply regret this measure.\n\nTariffs are taxes. They are bad for business and worse for consumers. They are disrupting supply chains. They bring uncertainty for the economy. Jobs are at stake. Prices up. Nobody needs that on both sides, neither in the European Union nor in the United States.\n\nThe European Union must act to protect consumers and business.\n\nShe said the counter measures “are strong but proportionate”. As the United States is applying tariffs worth $28bn, the EU is responding with countermeasures worth €26bn. She added:\n\nIn the meantime, we will always remain open to negotiations.\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\nKey events\n\n12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\n12 Mar 2025\n\nClosing summary\n\n12 Mar 2025\n\nCanada to impose 25% tariffs on nearly $30bn in US imports\n\n12 Mar 2025\n\nStarmer: Negotiating economic deal with US, but 'will keep all options on the table'\n\n12 Mar 2025\n\nCanada to hit back with $20bn of counter-tariffs – AP\n\n12 Mar 2025\n\nBank of Canada cuts interest rates, citing trade tensions and US tariffs\n\n12 Mar 2025\n\nCooling US inflation sparks (limited) relief rally on Wall Street\n\n12 Mar 2025\n\nUS inflation dips more than expected to 2.8%\n\n12 Mar 2025\n\nEU official uses 'stinking fish' analogy for negotiations\n\n12 Mar 2025\n\n'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions\n\n12 Mar 2025\n\n'I feel utter anger': a movement to boycott US goods is spreading\n\n12 Mar 2025\n\nGermany, Ireland and Italy likely to be hit hardest by US tariffs\n\n12 Mar 2025\n\nEC president announces EU countermeasures to US tariffs from April\n\n12 Mar 2025\n\nECB chief warns trade, defence shocks could lead to persistent inflation\n\n12 Mar 2025\n\nTrump tariffs cover household goods e.g. tin foil\n\n12 Mar 2025\n\nEuropean stock markets rise amid hopes of ceasefire in Ukraine; dollar gains\n\n12 Mar 2025\n\nCommunity Union: Tariffs 'hugely damaging and threaten jobs'\n\n12 Mar 2025\n\nUnite: UK-produced steel should be designated critical national infrastructure\n\n12 Mar 2025\n\nTreasury minister: UK reserves right to retaliate but will be 'pragmatic'\n\n12 Mar 2025\n\nUK Steel: Tariffs will have 'hugely damaging consequnces'\n\n12 Mar 2025\n\nMore on Europe’s tariff countermeasures\n\n12 Mar 2025\n\nTariffs 'disappointing' says UK's trade secretary\n\n12 Mar 2025\n\nUS tariffs a 'dog act', says Australia's industry minister\n\n12 Mar 2025\n\nEU provides timing of tariff countermeasures\n\n12 Mar 2025\n\nOpening summary\n\nShow key events onlyPlease turn on JavaScript to use this feature\n\nPlease turn on JavaScript to use this feature\n\nDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. We’ll be back tomorrow. Bye! – JK\n\nDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nRead more\n\nRead more\n\nEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.\n\nKeep up with the latest news on our US and UK politics live blogs:\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – live\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – live\n\nRead more\n\nRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nRead more\n\nRead more\n\nThank you for reading. We’ll be back tomorrow. Bye! – JK\n\nCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\n\nCanada is retaliating with its own tariffs, from tomorrow.\n\nIn response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.\n\nLeBlanc said at a press conference\n\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States.\n\nThis includes steel products worth $12.6bn and aluminum products worth $3bn, as well as additional imported US goods worth $14.2bn for a total of $29.8bn. The list of additional products affected by counter-tariffs includes computers, sports equipment and cast iron products, as examples.\n\nIt’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.\n\nIt’s easy to forget that all countries are affected by US tariffs.\n\nBrazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.\n\nThe relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.The dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.\n\nThe relief rally on Wall Street, sparked by a dip in US inflation, is petering out.\n\nThe Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.\n\nHere in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The UK’s FTSE 100 index in London has edged 0.2% higher.\n\nThe dollar is having a better day after trading on Tuesday close to the four-month low it hit last Friday, rising by 0.3% against the basket of other major currencies. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.\n\nSpeaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\nBut we will keep all options on the table.\nYou can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nSpeaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US.\n\nI am disappointed to see global tariffs in relation to steel and aluminium, but we will take a pragmatic approach.\n\nWe are… negotiating an economic deal which covers and will include tariffs if we succeed.\n\nBut we will keep all options on the table.\n\nYou can read more on our politics live blog:\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nRead more\n\nRead more\n\nCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025\n\nCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.\n\nThe EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.\n\nCanada is the largest foreign supplier of steel and aluminium to the US.\n\nBREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025\n\nBREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. President Donald Trump's metal tariffs, AP sources say. https://t.co/OHfmfwWa7J\n\nWhile US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.The central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\n\nWhile US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. It reduced its policy rate by a quarter of a percentage points to 2.75% from 3%.\n\nThe central bank is worried about the impact of US tariffs on the Canadian economy. It explains.\n\nThe Canadian economy entered 2025 in a solid position, with inflation close to the 2% target and robust GDP growth. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. The economic outlook continues to be subject to more-than-usual uncertainty because of the rapidly evolving policy landscape.\n\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\n\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon\n\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\n\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.\n\nIts chief executive Duncan Edwards said:\n\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. However, imposing tariffs on a close trading partner like the UK does not feel helpful to either country. Rather than fostering economic growth, these measures introduce unnecessary friction in a strong and mutually beneficial trade relationship.\n\nWe welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive.\n\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\n\nWhile US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.\n\nHe said:\n\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Tariff fears are already seeing companies nudging prices higher and risk higher inflation readings over the summer.\n\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.The dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.Daniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n\nThere has been a bit of a relief rally on Wall Street following the slowdown in US inflation. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.\n\nOver here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Sentiment has been lifted by hopes of a 30-day ceasefire in Ukraine – although Russia is yet to respond to the proposal agreed by the US and Ukraine. The German, French and Italian indices are between 1.2% and 1.8% higher. The UK’s FTSE 100 index is only 0.3% ahead, up 25 points at 8,521.\n\nThe dollar has strengthened today following days of selling pressure sparked by “Trumpcession” fears. The greenback is trading 0.4% higher against a basket of major currencies. Sterling is down a smidgen at $1.29340 while the euro has lost 0.3%, dipping back below $1.09 to $1.0890.\n\nDaniela Sabin Hathorn, senior market analyst at the trading platform Capital.com, said:\n\nConsumer inflation has softened in February. That is the key takeaway from the latest data released on Wednesday. Both headline and core CPI came in lower than expected at 2.8% and 3.1% respectively. Additionally, both monthly readings also dropped from the previous month and came in below expectations at 0.2%.\n\nAs anticipated, the initial market reaction was a relief rally in US equities, accompanied by a weaker US dollar and lower yields. However, this momentum has struggled to sustain itself. The dollar and yields have rebounded from their initial knee-jerk declines, turning higher, while equity indices have found limited buying interest to push significantly higher.\n\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\n\n“Not as good as it looks” – is the verdict on the drop in US inflation from Thomas Ryan, North America economist at Capital Economics.\n\nThe softer 0.23% month on month rise in core CPI in February is not as encouraging at it looks, as the components which feed into the Fed’s preferred PCE price index rose more sharply. While it will depend a lot on the producer price index (PPI) data tomorrow, our preliminary calculations point to another above-target consistent 0.3% month on month gain in the core PCE deflator last month.\n\nCore CPI inflation was pulled down by some much smaller gains in hospital services and motor vehicle insurance, as well as a sharp 4% month-on-month decline in airfares. None of those feed into PCE, however, although we assume that the PPI data tomorrow will also show at least moderate declines in the key airfare components.\n\nOtherwise, food at home prices were broadly unchanged despite another 10% surge in egg prices. With energy prices also better behaved on the month, this led to a relatively soft 0.22% month-on-month rise in headline CPI, pulling down the annual rate to 2.8%, from 3.0%.\n\nThe upshot is that, absent a huge downside surprise in the PPI data tomorrow, inflation is still running too hot for the Fed to consider cutting interest rates. At next week’s meeting, we expect the Fed to reiterate that it is in no hurry to loosen policy again.\n\nExplore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nTrump tariffsBusiness liveTrump administrationDonald TrumpTariffs\n\nShareReuse this content\n\nReuse this content\n\nMost viewedMost viewed\n\nMost viewedMost viewed\n\nMost viewedMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed\n\nMost viewed",
  "date": "",
  "source_type": "news_outlet",
  "extracted_at": "2025-04-07T13:38:33.289218",
  "metadata": {
    "description": "Brussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil",
    "og:type": "article",
    "og:site_name": "the Guardian"
  },
  "relevance_score": 0.425,
  "summary": "Business liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happenedBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShareKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this contentMost viewedMost viewed\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffsTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nBusiness liveTrump tariffs\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nTrump tariffs of 25% on steel and aluminium come into effect globally as Europe says it will retaliate – as it happened\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n Updated 12 Mar 2025Julia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nFull story: Trump tariffs on steel and aluminium come into effect amid US-Canada trade war\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nBrussels countermeasures to target €26bn of US goods from April while UK takes ‘pragmatic’ approach; US tariffs cover wide range of household goods such as tin foil\n\nUpdated 12 Mar 2025\n\nUpdated 12 Mar 2025\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDTShare\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDT\n\nJulia Kollewe and Kate Lamb (earlier)Wed 12 Mar 2025 11.06 EDTFirst published on Wed 12 Mar 2025 02.13 EDT\n\nJulia Kollewe and Kate Lamb (earlier)\n\nShare\n\nShare\n\nKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\nKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\nKey events\n\n12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\n12 Mar 2025\n\nClosing summary\n\n12 Mar 2025\n\nCanada to impose 25% tariffs on nearly $30bn in US imports\n\n12 Mar 2025\n\nStarmer: Negotiating economic deal with US, but 'will keep all options on the table'\n\n12 Mar 2025\n\nCanada to hit back with $20bn of counter-tariffs – AP\n\n12 Mar 2025\n\nBank of Canada cuts interest rates, citing trade tensions and US tariffs\n\n12 Mar 2025\n\nCooling US inflation sparks (limited) relief rally on Wall Street\n\n12 Mar 2025\n\nUS inflation dips more than expected to 2.8%\n\n12 Mar 2025\n\nEU official uses 'stinking fish' analogy for negotiations\n\n12 Mar 2025\n\n'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions\n\n12 Mar 2025\n\n'I feel utter anger': a movement to boycott US goods is spreading\n\n12 Mar 2025\n\nGermany, Ireland and Italy likely to be hit hardest by US tariffs\n\n12 Mar 2025\n\nEC president announces EU countermeasures to US tariffs from April\n\n12 Mar 2025\n\nECB chief warns trade, defence shocks could lead to persistent inflation\n\n12 Mar 2025\n\nTrump tariffs cover household goods e.g. tin foil\n\n12 Mar 2025\n\nEuropean stock markets rise amid hopes of ceasefire in Ukraine; dollar gains\n\n12 Mar 2025\n\nCommunity Union: Tariffs 'hugely damaging and threaten jobs'\n\n12 Mar 2025\n\nUnite: UK-produced steel should be designated critical national infrastructure\n\n12 Mar 2025\n\nTreasury minister: UK reserves right to retaliate but will be 'pragmatic'\n\n12 Mar 2025\n\nUK Steel: Tariffs will have 'hugely damaging consequnces'\n\n12 Mar 2025\n\nMore on Europe’s tariff countermeasures\n\n12 Mar 2025\n\nTariffs 'disappointing' says UK's trade secretary\n\n12 Mar 2025\n\nUS tariffs a 'dog act', says Australia's industry minister\n\n12 Mar 2025\n\nEU provides timing of tariff countermeasures\n\n12 Mar 2025\n\nOpening summary\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this contentMost viewedMost viewed\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. The Dow Jones has edged 0.1% higher while the tech-heavy Nasdaq is 1.7% ahead and the S&P 500 index gained 0.7%.Over here, European stock markets have notched up chunky gains despite the looming trade war between the United States and the European Union. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\nShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nShow key events onlyPlease turn on JavaScript to use this featureLive feedFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. Explore more on these topicsTrump tariffsBusiness liveTrump administrationDonald TrumpTariffsShareReuse this content\n\nShow key events onlyPlease turn on JavaScript to use this feature\n\nPlease turn on JavaScript to use this feature\n\nFrom 12 Mar 2025Here is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – videoKey events12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summaryShow key events onlyPlease turn on JavaScript to use this featureDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JKCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations.The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. The pound is down a tad at $1.2939 while the euro is also slightly lower on the day, but back above the $1.09 level, at $1.0908.Speaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025While US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nFrom 12 Mar 2025\n\nFrom 12 Mar 2025\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\nHere is European Commission president Ursula von der Leyen announcing the EU’s countermeasures this morning. 1:26EU announces €26bn ‘countermeasures’ to US tariffs – video\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\n1:26\n\nKey events\n\n12 Mar 2025Closing summary12 Mar 2025Canada to impose 25% tariffs on nearly $30bn in US imports12 Mar 2025Starmer: Negotiating economic deal with US, but 'will keep all options on the table'12 Mar 2025Canada to hit back with $20bn of counter-tariffs – AP12 Mar 2025Bank of Canada cuts interest rates, citing trade tensions and US tariffs12 Mar 2025Cooling US inflation sparks (limited) relief rally on Wall Street12 Mar 2025US inflation dips more than expected to 2.8%12 Mar 2025EU official uses 'stinking fish' analogy for negotiations12 Mar 2025'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions12 Mar 2025'I feel utter anger': a movement to boycott US goods is spreading12 Mar 2025Germany, Ireland and Italy likely to be hit hardest by US tariffs12 Mar 2025EC president announces EU countermeasures to US tariffs from April12 Mar 2025ECB chief warns trade, defence shocks could lead to persistent inflation12 Mar 2025Trump tariffs cover household goods e.g. tin foil12 Mar 2025European stock markets rise amid hopes of ceasefire in Ukraine; dollar gains12 Mar 2025Community Union: Tariffs 'hugely damaging and threaten jobs'12 Mar 2025Unite: UK-produced steel should be designated critical national infrastructure12 Mar 2025Treasury minister: UK reserves right to retaliate but will be 'pragmatic'12 Mar 2025UK Steel: Tariffs will have 'hugely damaging consequnces'12 Mar 2025More on Europe’s tariff countermeasures12 Mar 2025Tariffs 'disappointing' says UK's trade secretary12 Mar 2025US tariffs a 'dog act', says Australia's industry minister12 Mar 2025EU provides timing of tariff countermeasures12 Mar 2025Opening summary\n\n12 Mar 2025\n\nClosing summary\n\n12 Mar 2025\n\nCanada to impose 25% tariffs on nearly $30bn in US imports\n\n12 Mar 2025\n\nStarmer: Negotiating economic deal with US, but 'will keep all options on the table'\n\n12 Mar 2025\n\nCanada to hit back with $20bn of counter-tariffs – AP\n\n12 Mar 2025\n\nBank of Canada cuts interest rates, citing trade tensions and US tariffs\n\n12 Mar 2025\n\nCooling US inflation sparks (limited) relief rally on Wall Street\n\n12 Mar 2025\n\nUS inflation dips more than expected to 2.8%\n\n12 Mar 2025\n\nEU official uses 'stinking fish' analogy for negotiations\n\n12 Mar 2025\n\n'This trade war serves no-one': business and trade committee chair pushes for tariff exemptions\n\n12 Mar 2025\n\n'I feel utter anger': a movement to boycott US goods is spreading\n\n12 Mar 2025\n\nGermany, Ireland and Italy likely to be hit hardest by US tariffs\n\n12 Mar 2025\n\nEC president announces EU countermeasures to US tariffs from April\n\n12 Mar 2025\n\nECB chief warns trade, defence shocks could lead to persistent inflation\n\n12 Mar 2025\n\nTrump tariffs cover household goods e.g. tin foil\n\n12 Mar 2025\n\nEuropean stock markets rise amid hopes of ceasefire in Ukraine; dollar gains\n\n12 Mar 2025\n\nCommunity Union: Tariffs 'hugely damaging and threaten jobs'\n\n12 Mar 2025\n\nUnite: UK-produced steel should be designated critical national infrastructure\n\n12 Mar 2025\n\nTreasury minister: UK reserves right to retaliate but will be 'pragmatic'\n\n12 Mar 2025\n\nUK Steel: Tariffs will have 'hugely damaging consequnces'\n\n12 Mar 2025\n\nMore on Europe’s tariff countermeasures\n\n12 Mar 2025\n\nTariffs 'disappointing' says UK's trade secretary\n\n12 Mar 2025\n\nUS tariffs a 'dog act', says Australia's industry minister\n\n12 Mar 2025\n\nEU provides timing of tariff countermeasures\n\n12 Mar 2025\n\nOpening summary\n\nShow key events onlyPlease turn on JavaScript to use this feature\n\nPlease turn on JavaScript to use this feature\n\nDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. This prompted countermeasures from the European Union and Canada, while Australia, the UK and other countries held back from announcing retaliatory action.EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read moreEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine.Keep up with the latest news on our US and UK politics live blogs:Canada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead moreStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead moreThank you for reading. – JK\n\nDonald Trump has begun another trade war, announcing 25% tariffs on all steel and aluminium imports into the United States. EU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’Read more\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nEU retaliates against Trump tariffs with €26bn ‘countermeasures’\n\nRead more\n\nRead more\n\nEuropean stock markets have rallied, cheered by hopes of a ceasefire in Ukraine. Keep up with the latest news on our US and UK politics live blogs:\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – liveRead more\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – live\n\nCanada to impose 25% tariffs on nearly $30bn in US imports as trade war flares – live\n\nRead more\n\nRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nRead more\n\nRead more\n\nThank you for reading. – JK\n\nCanada is retaliating with its own tariffs, from tomorrow.In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States.LeBlanc said at a press conference\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. In response to 25% tariffs imposed by Donald Trump on Canadian steel and aluminum imports, Canada’s finance minister, Dominic LeBlanc, says his country will tomorrow retaliate with levies of the same amount on almost $30bn in imports from the United States. LeBlanc said at a press conference\n\nI am announcing that the government of Canada, following a dollar for dollar approach, will be imposing, as of 12.01am, tomorrow, March 13, 2025, 25% reciprocal tariffs on an additional $29.8bn of imports from the United States. It’s easy to forget that all countries are affected by US tariffs.Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations. Brazil’s finance minister Fernando Haddad said that the South American country will not immediately retaliate against tariffs imposed by the United States on steel and aluminium imports, instead seeking negotiations. The relief rally on Wall Street, sparked by a dip in US inflation, is petering out.The Dow Jones is now down 0.7%, the S&P 500 is flat and the Nasdaq, which rose 1.8% earlier, is only 0.7% ahead.Here in Europe, the German and Italian equity markets are still more than 1% ahead while the French bourse has pared gains to trade 0.3% higher. You can read more on our politics live blog:Starmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nSpeaking at prime minister’s questions in parliament, Sir Keir Starmer didn’t rule out retaliatory tariffs against the US. You can read more on our politics live blog:\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics liveRead more\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nStarmer says he is not ruling out retaliatory tariffs against US and will keep ‘all options on table’ – UK politics live\n\nRead more\n\nRead more\n\nCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official.The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%.Canada is the largest foreign supplier of steel and aluminium to the US.BREAKING: Canada will announce more than $20 billion in retaliatory tariffs in response to U.S. https://t.co/OHfmfwWa7J— The Associated Press (@AP) March 12, 2025\n\nCanada is to hit back at Donald Trump’s 25% steel and aluminium tariffs with $20.7bn in retaliatory tariffs, Associated Press reported, citing a senior Canadian government official. The EU has also announced retaliatory trade action with new duties on US industrial and farm products, responding within hours to the Washington’s increase in tariffs on all global steel and aluminium imported into the US to 25%. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\n\nWhile US interest rate cuts are uncertain despite the dip in inflation today, the Bank of Canada has taken action. However, heightened trade tensions and tariffs imposed by the United States will likely slow the pace of economic activity and increase inflationary pressures in Canada. Bank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon— Bank of Canada (@bankofcanada) March 12, 2025\n\nBank of Canada reduces policy rate by 25 basis points to 2¾%https://t.co/ZnFzJbHkJV#economy #cdnecon\n\nBritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium.Its chief executive Duncan Edwards said:\nThe new US administration has set out to be a pro-business, pro-growth government and there is much in its agenda that our members will be encouraged by. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. BritishAmerican Business, a transatlantic trade and business group, representing more than 470 companies on both sides of the Atlantic, has responded to the US tariffs on steel and aluminium. We welcome the UK government’s decision not to introduce its own retaliatory tariffs, and we hope discussions between the two governments can help reduce trade and investment barriers, strengthen economic ties, and ensure businesses on both sides of the Atlantic can thrive. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.He said:\nGood news on inflation, but the fact it was overwhelmingly caused by falling airfares has muted the market reaction. While US inflation has cooled, US tariffs threaten to push price growth higher again in coming months, warned James Knightley, chief international economist at ING.",
  "entities": {
    "countries": [
      "australia",
      "brazil",
      "canada",
      "germany",
      "russia",
      "united states"
    ],
    "organizations": [
      "un"
    ],
    "key_issues": [
      "country",
      "nation",
      "state",
      "government",
      "approach",
      "policy",
      "action",
      "aid",
      "relief",
      "economic",
      "economy",
      "trade",
      "market",
      "industry",
      "investment",
      "un"
    ]
  },
  "committee": "First Committee",
  "topic": "Regulating the use of private military contractors in conflict zones"
}