{
  "url": "https://www.uneca.org/stories/keynote-speech-by-mr.-antonio-pedro-at-the-african-union-pan-african-youth-leadership-summit",
  "title": "Keynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit | United Nations Economic Commission for Africa",
  "text": "Skip to main content\n\n\n\nYou are hereHome » Stories » Keynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n \n\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n\n \n\n\n\n\n\n\n\n\n\n\n© United Nations Economic Commission for Africa\n\n Home\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA\n\nSkip to main content\n\nYou are hereHome » Stories » Keynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\nHome » Stories » Keynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025\n\n3 April, 2025\n\n3 April, 2025\n\nShare this:facebooktwitteremailprint\n\nShare this:\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills. \nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\nWe can use such guidance to assess and evaluate our sectors and skills needs.\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\nTo build scale, we need more of these initiatives from the government and the private sector. \nAnd, of course, we have the AfCFTA.\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\nThank you.\n\n\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the\n\nAfrican Union Pan-African Youth Leadership Summit\n\n“Unlocking the Power of Youth for a Prosperous Africa”\n\nBy\n\nMr. Antonio Pedro\n\nDeputy Executive Secretary (Programme Support)\n\nUnited Nations Economic Commission for Africa\n\n3 April 2025\n\nat the Adwa Memorial\n\nHonorable Chairpersons,\n\nEsteemed Panelists,\n\nDistinguished Guests,\n\nLadies and Gentlemen, and Most Importantly,\n\nthe Bright and Resilient Youth of Africa,\n\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. This gathering represents the collective spirit and commitment of young people who are eager to take charge of their destinies and build the Africa of tomorrow.\n\nAfrica is a continent on the rise. With over 60% of its people under the age of 25, it is home to the world’s youngest population. Despite this, it is also the continent with almost 76 million young Africans not in formal employment, education, or training (NEET).\n\nAlthough 10-12 million youths enter the workforce annually, only around 3 million formal jobs are created in Africa[1], leaving a significant gap in terms of job creation. Further, millions of young Africans are facing barriers to entrepreneurship, and struggling to access the skills, capital, and networks needed to succeed.\n\nThe high number of young people excluded from economic and political activities underscores the critical challenge of the disempowered youth population on the continent.\n\nAs such, it is vital to include young people in decision-making and give them appropriate opportunities to work and innovate! The 2030 Agenda for Sustainable Development and Agenda 2063 underscore the importance of promoting the rights of young people and meeting their needs, in all their diversity.\n\nEngaging young people is central to the successful implementation of the transformative agenda in Africa.\n\nAchieving these aspirations requires an understanding of the needs, interests, challenges, and potential of Africa’s youth.\n\nIt also needs youth representatives in economic and political dialogue, decision-making and implementation.\n\nWe must strengthen meaningful youth engagement in policymaking and decision-making processes. This requires interventions at an institutional level, through youth organizations and networks as well as in support of policymakers who can listen to and respond to the voices of youth.\n\nFor the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\nStrengthen the evidence base for more effective youth policy formulation and implementation.\n\nMoreover, we need to assess the foundation of economic empowerment- that is, education and skills.\n\nThe education system must evolve to meet emerging societal needs and the demands of the modern economy.  Over 80% of African youths in school aspire to work in high-skilled occupations. Still, only 8% find such jobs. [2]\n\nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Skills training programs and active labor market policies are key to helping young people integrate into decent jobs in the formal sector.\n\nTo this end, the ILO provides a practical guide named Skills for Trade and Economic Diversification (STED) that looks at matching skills with the fast-changing world of employers’ demanding skills, and emerging industries.\n\nIn one of their pilots, ILO supported Bangladesh’s agro-food sector by assessing skills required to bridge existing business capability gaps, which highlighted the required skills for business to function, such as food product development, logistics and quality assurance managers. This had then led to a wider reform of Bangladesh’s education and training systems.\n\nWe can use such guidance to assess and evaluate our sectors and skills needs.\n\nOther examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries.\n\nTogether with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition.\n\nA PwC report estimates that AI could add $15.7 trillion to the global economy by 2030, with Africa’s share estimated at $1.3 trillion- surpassing both Foreign Direct Investment and Illicit Financial Flows (IFFs).\n\nThis could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity.\n\nThe good news is that initiatives on increasing the attainment of digital skills for youth are plentiful on the continent.\n\nThese include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries.\n\nSome of the success stories from such initiatives include mPharma, an AI-driven pharmaceutical investor management platform, and data analytics company co-founded by Eric M from C4D Lab.\n\nIn other words, youth are ready to innovate and create, and we, as leaders and decision-makers, need to attend to this, urgently.\n\nEntrepreneurship is a powerful engine of job creation, but too often, young entrepreneurs face challenges. Lack of access to finance, mentorship, and networks are among the bottlenecks youth face when pursuing entrepreneurship. Creating ecosystems that target the youth population on their entrepreneurship journey is therefore key.\n\nThis can include creating training packages and complementing with financing and mentoring solutions, which would lead to improving access to affordable credit, and fostering creativity and innovations.\n\nThe Tony Elumelu Entrepreneurship Program (TEEF) is an example of this holistic approach and has supported over 13,000 young African entrepreneurs over the last 10 years, providing seed capital, training, mentoring and access to networks of businesses. For example, in Kenya, TEEF provided seed funding to Wangari Mwai, who used it to start a mobile phone application company, providing jobs for over 50 youth in the tech space.\n\nTo build scale, we need more of these initiatives from the government and the private sector.\n\nAnd, of course, we have the AfCFTA.\n\nWhile the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success.\n\nBy reducing trade and other barriers, implementation of the Agreement can make it easier for companies to operate across borders, thus facilitating the entry of young Africans into higher-skilled and more productive and innovative sectors, such as agrifoods and climate-smart agriculture.\n\nThe Agreement opens new export opportunities for young Africans, if they possess the requisite knowledge and skills. Private sector development, with a particular emphasis on SMEs, women, and youth, remains a pivotal priority, reflected in 27 of 37 National AfCFTA Implementation Strategies we helped formulate.\n\nThese strategies underscore the critical need to empower SMEs, especially those led by the youth, to engage meaningfully in AfCFTA-driven economic activities.\n\nTo make the AfCFTA work for the youth, we must accelerate the ratification of the Protocols on the Free Movement of People, Goods and Services, Intellectual Property, Investment, and Competition.\n\nOpportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector.\n\nIn Africa, there is a shift towards adopting more sustainable waste disposal and management technologies. For the period of 2025-30, out of total 160 disclosed urban infrastructure projects across African cities, 50 waste management projects were ranked highest valued at US$ 935 million.\n\nFor example, the Industrial Symbiosis in Ghana identified 135 potential synergies across 46 waste streams from 26 industrial parks and created 1,623 jobs. In Tanzania, the Tan-Ko Mirae Green Company processes cashew nutshell waste into biofuel and industrial products, creating jobs in waste collection, processing and manufacturing, while reducing reliance on wood-based charcoal.\n\nIn recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level.\n\nECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria.\n\nThis event, titled “Transforming Africa with Youth-Driven Solutions,” focused on driving jobs creation and economic growth through sustainable, inclusive and evidence-based solutions for the 2030 Agenda and Agenda 2063.\n\nIn the same spirit, this is the theme set for this year’s Africa Regional Forum for Sustainable Development (ARFSD-11). Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa.\n\nTo empower our youth economically, we must promote inclusive, sustainable and job-creating economic growth rates of at least 7% and preferably double-digit growth.\n\nThis is a call for the transformation of our comparative advantages into competitive advantages. Science, Technology and Innovation (STI) is central to achieving these goals.\n\nWe will need an ecosystem for transformational change, bringing coordinated, intentional, and evidence-based multi-stakeholder action together.\n\nLet this forum be a turning point. Let us commit to tangible action, and to creating pathways for young people to thrive. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all.\n\nThank you.\n\n[1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n[1] - African youths, an asset for their countries\n\n[1] - African youths, an asset for their countries\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n© United Nations Economic Commission for Africa\n\n© United Nations Economic Commission for Africa\n\n© United Nations Economic Commission for Africa\n\nHome\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA\n\nHome\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA",
  "date": "",
  "source_type": "other",
  "extracted_at": "2025-04-07T14:26:30.031086",
  "metadata": {
    "description": "Keynote Speech at the African Union Pan-African Youth Leadership Summit “Unlocking the Power of Youth for a Prosperous Africa” By Mr."
  },
  "relevance_score": 0.65,
  "summary": "Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n\n \n\n\n\n\n\n\n\n\n\n\n© United Nations Economic Commission for Africa\n\n Home\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA\n\nSkip to main content\n\nYou are hereHome » Stories » Keynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote speech by Mr. Antonio Pedro at the African Union Pan-African Youth Leadership Summit\n\n\n\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025Share this:facebooktwitteremailprintKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n3 April, 2025\n\n3 April, 2025\n\n3 April, 2025\n\nShare this:facebooktwitteremailprint\n\nShare this:\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the \n  \nAfrican Union Pan-African Youth Leadership Summit\n \n“Unlocking the Power of Youth for a Prosperous Africa”\n \nBy\n \nMr. Antonio Pedro\nDeputy Executive Secretary (Programme Support)\nUnited Nations Economic Commission for Africa\n  \n3 April 2025\nat the Adwa Memorial\nHonorable Chairpersons, \nEsteemed Panelists, \nDistinguished Guests, \nLadies and Gentlemen, and Most Importantly, \nthe Bright and Resilient Youth of Africa,\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2] \nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\nKeynote Speech at the\n\nAfrican Union Pan-African Youth Leadership Summit\n\n“Unlocking the Power of Youth for a Prosperous Africa”\n\nBy\n\nMr. Antonio Pedro\n\nDeputy Executive Secretary (Programme Support)\n\nUnited Nations Economic Commission for Africa\n\n3 April 2025\n\nat the Adwa Memorial\n\nHonorable Chairpersons,\n\nEsteemed Panelists,\n\nDistinguished Guests,\n\nLadies and Gentlemen, and Most Importantly,\n\nthe Bright and Resilient Youth of Africa,\n\nIt is both an honor and a privilege to stand before you today at this critical forum, as we engage in conversations that will shape the future of Africa—a future where the power of youth drives prosperity, innovation, and transformation. For the promotion of policy direction that taps into the development potential readily presented by African youth, countries must:\n\nImplement national youth policies that account for diversity and demographic changes in the youth population;\n\nPromote investments that absorb the capacities of youth in a variety of sectors, including education, health, employment, economy, governance, and civic engagement; and\n\nStrengthen the evidence base for more effective youth policy formulation and implementation. [2]\n\nWe need to scale a system that equips our youth not only with the skills of today, but also with the skills of the future— vocational skills in technology, innovation, critical thinking, and entrepreneurship, beyond academia. Other examples of active labor market policies is the South African Youth Employment Service (YES), which plays a similar role in skill-matching, of which youth gain work experience through paid placements and apprenticeships across industries. Together with skills and education, transformative pathways, such as Science, Technology, and Innovation (STI), are essential for empowering Africa’s youth, especially with the global shifts in artificial intelligence (AI) and the green transition. This could significantly boost inclusive, sustainable growth in Africa by enabling opportunities and job creation for the youth, benefiting the continent’s future prosperity. These include Google for Startups- Africa, Andela, and Centre for Data Science and Technology (C4D Lab) from the University of Nairobi, which are providing support to young tech innovators across Africa, offering training and job placements in the tech industries. While the continent is taking advantage of the untapped opportunities for deeper trade integration within the African Continental Free Trade Area, the involvement of the youth in the implementation of the Agreement will be central to its success. Opportunities for youth job creation also exist outside the traditional models, and one that demonstrates great potential for youth empowerment is the potential for Africa’s circular economy in the industrial waste management sector. In recognition of all these key issues, last year, the United Nations Economic Commission for Africa (ECA) collaborated with and organized several fora and engagements to highlight the issue of youth empowerment at a higher level. ECA co-organized a pre-event during the 2024 Summit of the Future in New York with the United Nations Office of the Special Adviser on Africa (OSAA), the UN Department of Global Communications (DGC), UNDP, AUC and the Pan African Youth Union (PYU), in collaboration with AU Member States Malawi and Nigeria. Further, ECA is establishing the African Development Impact Forum, with the 2025 theme being “Best Practices and Innovative Solutions for Job Creation in Africa” to look for impactful solutions and implementation best practices to catalyze systematic change that generates meaningful job opportunities across Africa. Together, we can unlock the full potential of Africa’s youth and build a prosperous future for all. [1] - African youths, an asset for their countries\n\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n[1] - African youths, an asset for their countries\n\n[1] - African youths, an asset for their countries\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n[2] - More investment in skills development is key to Africa’s growth potential\n\n© United Nations Economic Commission for Africa\n\n© United Nations Economic Commission for Africa\n\n© United Nations Economic Commission for Africa\n\nHome\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA\n\nHome\nAbout UsOverview\nCommission\nExecutive Secretary\nDeputy Executive Secretary (Programme Support)\nDeputy Executive Secretary (Programme)\nFormer Executive Secretaries\nTerms of Reference and Rules of Procedure\nOpportunitiesVacancies\nFellowship\nProcurement\nExpression of Interest\nInternship Programmes\n\n\nOur WorkData and statistics\nAfrican Institute for Economic Development and Planning (IDEP)\nGender Equality and the Empowerment of Women\nMacroeconomics, Finance and Governance\nPoverty, Inequality and Social Policy\nPrivate Sector Development and Finance\nRegional Integration and Trade\nSubregional Activities for Development\nClimate Change, Food Security and Natural Resource\nTechnology, Innovation, Connectivity and Infrastructure\nStrategic DirectionsAdvocate\nBuild\nDesign\nFormulate\nSupport\n\nSubregional OfficesCentral Africa\nEastern Africa\nNorth Africa\nSouthern Africa\nWest Africa\n\n\nKnowledge GatewayPublications\nAfrica UN Knowledge Hub for COVID-19\nECA Repository\nASKIA Federated Search Engine\nECA Research Guide\nThematic Portals\n\nData & Statistics\nEventsCalendar of Conferences, Meetings and Events\n\nMedia CentreStatements and Messages\nPodcasts\n\nContact ECA",
  "entities": {
    "countries": [],
    "organizations": [
      "united nations",
      "un",
      "who"
    ],
    "key_issues": [
      "issue",
      "challenge",
      "nation",
      "state",
      "government",
      "region",
      "solution",
      "approach",
      "policy",
      "initiative",
      "program",
      "action",
      "development",
      "aid",
      "economic",
      "economy",
      "financial",
      "trade",
      "market",
      "investment",
      "united nations",
      "un",
      "organization",
      "foundation"
    ]
  },
  "committee": "Economic and Social Council",
  "topic": "Promoting rural development in Africa"
}