{
  "url": "https://www.crisisgroup.org/asia/south-east-asia/myanmar/support-vital-myanmars-quake-victims-despite-military-obstacles",
  "title": "Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles | Crisis Group",
  "text": "\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox.\n\n\nSubscribe here\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Review our privacy policy for more details.\n\n\nYes, I Agree\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox.\n\n\nSubscribe here\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\n\n\n\n\n\n\n\n\n\n\n            Share          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print          \n\n\n\n\n\n\n\n\n\n\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.\n\nShare          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print\n\nShare          \n\n\n\n\n\n\n                Facebook              \n\n\n\n\n\n\n                Twitter              \n\n\n\n\n\n\n                Email              \n\n\n\n\n\n\n                Linkedin              \n\n\n\n\n\n\n                BlueSky              \n\n\n\n\n\n\n                Whatsapp              \n\n\n\n\n\n\n\n\n            Save          \n\n\n\n\n\n\n            Print\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\nWhat is happening?\n\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\n\n\n\n    While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n  \n\n\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally. \n\n\n\n\n    Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n  \n\n\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\n\nWhat impact could the disaster have on the conflict and the regime?\n\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\n\nWhat should be done now?\n\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\n\nRelated Tags\n\nWhat is happening?\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents. Even those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\nA 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. The epicentre, at a depth of 10km, was just 16km north of Sagaing town and close to the country’s second largest city of Mandalay, which has a population of 1.6 million. It was followed by several large aftershocks, including one of 6.4 magnitude about ten minutes after the initial quake that may have compounded the damage. The main earthquake was the largest to hit Myanmar in over a century. Its impact was felt as far away as Taiwan and southern Vietnam, with damage and casualties reported in southern China and neighbouring Thailand. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.\n\nThe full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Sagaing town has been ravaged, with 80 per cent of its buildings reportedly damaged and few survivors pulled from the rubble; though close to Mandalay on the opposite bank of the Ayeyarwady (Irrawaddy) River, the town is largely cut off because of damage to two key bridges. The capital Naypyitaw also suffered serious damage, with several senior officials and civil servants killed in their offices and many more in staff housing blocks that tumbled to the ground. The main hospitals in Mandalay and Naypyitaw were themselves damaged or destroyed, and the deluge of patients arriving with traumatic injuries from the quake had to be treated outside in stifling heat or in makeshift tents.\n\nEven those buildings in the impact zone that appear reasonably unscathed have likely suffered structural damage and may yet fall down or need to be demolished. With minimal search-and-rescue capacity available in Myanmar, people dug through rubble with their bare hands looking for survivors. The military, which would normally be at the forefront of such efforts – but which has violently repressed dissent since the February 2021 coup and is widely reviled – was mostly missing from the picture. Rescue efforts were slow-going, and most of those trapped in the fierce summer heat had perished before they could be extricated. The dead included more than 700 Muslim worshippers, since the earthquake struck during Friday prayers and mosques were crowded at the end of Ramadan. Mandalay is renowned as one of the most important centres of Buddhism in Myanmar; venerated pagodas crumbled and hundreds of Buddhist monks died in collapsing monasteries.\n\nWhile a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars.\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\nSince the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Public infrastructure is crippled: the electricity grid is badly affected, as are communications, roads, bridges and railway lines. Both major airports in central Myanmar – at Mandalay and Naypyitaw – have been closed due to serious structural damage, complicating aid logistics. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.\n\nThe picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. Getting information from these areas is even more challenging, not only because of disruptions caused by the earthquake itself, but because the military has long enforced an internet and mobile phone blackout as part of its counter-insurgency efforts. While these areas may have suffered less devastation – they have a lower population density and few high-rise buildings – they have still been badly hit. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict.\n\nWhat are the immediate priorities and likely challenges for the humanitarian response?\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve. Given the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally.\n\nThe regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The first responses to this call came from the region. China dispatched a 37-member search-and-rescue team early on 29 March, while relief supplies from both India and the Association of Southeast Asian Nations arrived the same day. Russia, Bangladesh, Malaysia, Singapore and Thailand all sent rescue teams and equipment over the weekend. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.\n\nBut as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.\n\nMajor damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. Damaged communications and lack of electricity create another set of obstacles. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Families, communities and local relief organisations have little left in reserve.\n\nGiven the cost and difficulty of reconstruction in the war-torn country, the humanitarian assistance phase will last for many months and require substantial resources. It is not clear where these will come from, despite an initial allocation of funds from regional countries and Western donors. The global humanitarian system is running on empty, the result of huge needs in Gaza, Ukraine, Sudan, the Democratic Republic of Congo and elsewhere as well as the sudden demise of USAID, which was the largest provider of life-saving assistance in Myanmar and globally.\n\nMany observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help.\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.This task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\nMany of these challenges – difficult logistics, pre-existing crisis and scarce humanitarian resources – are not unusual in major natural disasters. But added to these is the political predicament that Myanmar finds itself in. The earthquake comes at a time when a beleaguered, illegitimate junta is locked in an existential battle with its opponents, who make up a mosaic of long-established ethnic armed groups and resistance forces born after the coup. Many observers are understandably questioning whether Myanmar’s generals are sincere in their calls for international help. Are they willing to issue the visas to allow expert staff – from international agencies, not just friendly neighbours – to deploy to the country quickly? Will they allow humanitarian relief bodies to operate with the independence needed for an effective, equitable response? Will they try to direct aid to their core constituents and away from their adversaries?\n\nThese are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. But whether the regime will follow through on its call for international aid and allow the visas, access and humanitarian independence required is an empirical question that needs to be tested. The only way to do so is for humanitarian organisations and donors to work as hard as possible to deliver aid to those who desperately need it. For now, the focus must be on mobilising the resources and expertise for a major humanitarian response. If the regime imposes unworkable restrictions, deft and robust diplomacy will be needed to overcome them.\n\nThis task will likely prove arduous, but there is a precedent. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. But once the military rulers were convinced to open up, an effective, large-scale aid effort was able to proceed more or less unhindered. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. As a result, the victims of Cyclone Nargis received only one tenth of the per capita assistance provided to Indonesia’s Aceh province following the Indian Ocean tsunami four years earlier. For the sake of the millions of people affected by the current disaster, who are sleeping in the open with limited access to clean drinking water, food and medical supplies, all concerned must strive to the best of their ability to deliver aid.\n\nWhat impact could the disaster have on the conflict and the regime?\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.For the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\nDespite the chaos, regime forces have continued their military operations against resistance forces, including deadly airstrikes, some of which are taking place in earthquake-affected areas. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. Although the NUG has authority over only a small proportion of the regime’s battlefield opponents, this step is symbolically important. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.\n\nWhile the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. It also suggests that the regime will be disinclined to permit agencies to deliver aid across the conflict’s front lines. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. While it does not appear at this stage that the belligerents are deliberately trying to gain tactical advantage for themselves from the earthquake, they clearly wish to prevent their opponents from obtaining any benefit from a reduction in hostilities.\n\nFor the regime, the disaster presents major political risks. Senior General Min Aung Hlaing had just returned in a triumphal mood from state visits to Russia and Belarus, where he was warmly received. He appeared buoyed by the fact that the geopolitical winds have finally turned in his favour – with U.S. support for his domestic opponents evaporating after President Donald Trump’s dismantling of foreign aid and Washington’s pivot toward Moscow emboldening his closest ally, Vladimir Putin, and giving Russia the diplomatic bandwidth and confidence to invest more heavily in relations with his regime. Min Aung Hlaing now has to contend with one of the worst natural disasters in Myanmar’s history, however, and one that has hit regime strongholds particularly hard. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While it is difficult to predict the precise impact of this calamity, Min Aung Hlaing knows that there will be political aftershocks. It is a moment of jeopardy for him and his regime.\n\nWhat should be done now?\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Prior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\nIt is essential that the regime and all the armed groups arrayed against it immediately institute a ceasefire or humanitarian pause in the affected areas. The military should end airstrikes at once. The regime must also halt military conscription, which it initiated in 2024 as a result of battlefield losses. Failure to do so will deter vital staff and volunteers – young men and women of conscription age – from participating in the front-line relief effort. The regime should also issue an amnesty for health workers, many of whom went on strike in protest of the coup as part of a broader civil disobedience movement, and were subsequently sacked from state hospitals and banned from practising in the private sector. These doctors and nurses, many of whom have fled to resistance-controlled areas, represent a crucial component of any effective health response. Likewise, the many health workers who are imprisoned for their opposition to the regime should be released and permitted to contribute their skills. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.\n\nThe regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible.\n\nPrior to the earthquake, Myanmar’s crisis was forgotten, receiving little global attention in spite of the fact it has been, for the last four years, Asia’s most deadly conflict. This natural disaster has pushed it back onto the front pages, and there is now far greater international awareness of the huge challenges being faced by its people. But after the news cycle has moved on, Myanmar will still need sustained support for essential life-saving needs, while the painstaking tasks of recovery and reconstruction get under way. The danger that a properly funded and organised response is misdirected by the regime is real. But the conditions in Myanmar and in the humanitarian system worldwide mean the most pressing risk is that there is no well-funded effort to bring relief to the earthquake’s victims at all. The immediate priority is that the world not abandon the people of Myanmar again.\n\nRelated Tags\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\nBriefing\n /\n    \n          Asia\n\nAlso available in Burmese\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommentary\n /\n    \n          Global\n\nAlso available in Arabic, Français, Russian and other languages\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox.\n\n\nSubscribe here\n\nSubscribe to Crisis Group’s Email Updates\n\nReceive the best source of conflict analysis right in your inbox.\n\nReceive the best source of conflict analysis right in your inbox.\n\nSubscribe here\n\nThis site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Review our privacy policy for more details.\n\n\nYes, I Agree\n\nThis site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Review our privacy policy for more details.\n\n\nYes, I Agree\n\nThis site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Review our privacy policy for more details.\n\nThis site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Review our privacy policy for more details.\n\nYes, I Agree",
  "date": "",
  "source_type": "other",
  "extracted_at": "2025-04-07T13:46:49.645436",
  "metadata": {
    "description": "The massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting.",
    "og:type": "article"
  },
  "relevance_score": 0.5,
  "summary": "REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. In this Q&A, Crisis Group expert Richard Horsey discusses the urgent need for international assistance, the challenges facing aid delivery against a backdrop of civil war and the importance of a humanitarian pause in fighting. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The day after the disaster, the National Unity Government (NUG) – a parallel administration appointed by elected lawmakers ousted in the 2021 coup, which operates mostly from exile – announced that the armed units it controls will implement a “two-week pause in offensive military operations” in affected areas. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\n\n\n\n\n\n\n\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommuters drive past a building that collapsed, in the aftermath of a strong earthquake, in Mandalay, Myanmar, March 30, 2025. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. REUTERS / Stringer\n\n\n\n\n\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. REUTERS / Stringer\n\nQ&A\n\n                     /  Asia\n01 April 2025\n11 minutes\n\n\n      Support Vital for Myanmar’s Quake Victims, Despite Military Obstacles \n    \n\nThe massive earthquake in Myanmar has taken a terrible toll. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. In Bangkok, 1,000km from the epicentre, the shock waves brought down a 30-storey building under construction; in a cruel irony, many of the workers who died as a result are thought to be migrants from Myanmar.The full extent of damage is not yet clear, but the destruction visited on Mandalay city and surrounding areas is plain to see, including in footage of multi-storey buildings collapsing in seconds. A 7.7-magnitude earthquake struck central Myanmar on 28 March, causing widespread devastation and killing at least 2,700 people – a toll that is likely to rise sharply in the coming days as information from affected areas trickles in. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. While a comprehensive damage assessment has yet to be conducted, it is already clear that reconstruction costs will run into the tens of billions of dollars, with no plausible way to raise such sums given the regime’s difficulties in gaining access to foreign credit.The picture outside the major urban centres is even harder to piece together. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. Since the earthquake, many people in the impact zone have been sleeping on the streets or other open areas, either because they lost their homes or because they are afraid to return to them given structural damage or the risk of aftershocks. Rural parts of Sagaing region, which have been scarred by the conflict raging across Myanmar since the coup, are mostly under the control of armed resistance groups, not the regime. They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. The UN also mobilised its limited in-country resources to conduct damage and needs assessments and begin delivery of vital assistance while it ramps up a larger response.But as the focus shifts from conducting search-and-rescue operations to assisting the survivors – with clean water, sanitation, food, shelter and medical care – aid agencies are confronting daunting logistical, financial and political challenges.Major damage to road, rail and airport infrastructure caused by the earthquake means that simply reaching some of the affected areas is difficult. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. The regime quickly declared a state of emergency in six states and regions and issued a rare plea for international aid, with junta leader Min Aung Hlaing saying in a national address just hours after the earthquake: “I would like to invite any country or organisation to come and assist”. So, too, does the fact that Myanmar was already facing a major humanitarian crisis due to the coup and subsequent armed conflict, which has displaced more than three million people and crippled the economy. Will they try to direct aid to their core constituents and away from their adversaries?These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. These are important concerns, not just because the junta has been blocking aid to areas under the control of other forces during post-coup fighting, but also because it has a track record of doing the same in previous natural disasters, particularly after Cyclone Mocha struck conflict-riven Rakhine State in 2023, killing hundreds and destroying some 200,000 houses and other buildings, including many in rebel-controlled areas. When Cyclone Nargis struck Myanmar in 2008, killing an estimated 140,000 people, the military regime in power at the time spent three weeks downplaying the seriousness of the crisis and stonewalling the international response. Nevertheless, the regime’s initial denials and restrictions, and a huge number of unsubstantiated allegations by outside activists claiming that the military was stealing or diverting aid, gave many donors pause. The far more powerful ethnic armed groups still fighting the military – including the Arakan Army, Ta’ang National Liberation Army, Kachin Independence Organisation and Karen National Union – have not announced a halt to hostilities.While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. While the fighting is not affecting the worst-hit area of urban Mandalay and its environs, the fact that neither the regime nor any of its most powerful opponents has even hinted at a humanitarian pause sends a signal that, apart from the NUG, no conflict party is willing to give priority to the relief operation. Although aid organisations may find more indirect ways to help people in areas not controlled by the regime, such as working through local community groups already in place, access across the battlelines would nevertheless help them reach all those affected by this disaster. As a deeply superstitious person himself, he is aware that many in his inner circle – and in much of the country – may interpret the disaster as a kind of karmic retribution for the coup and the violence his regime has subsequently unleashed on the people of Myanmar. Pre-existing internet and mobile phone shutdowns in some of the affected conflict areas should also be lifted.The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. The regime has a huge credibility problem, domestically and internationally, and proactive steps such as these are vital for giving respite to the long-suffering population and for convincing donors and aid agencies that an international aid operation will be feasible. Related Tags\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nMore for you\n\n\n\n\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\nBriefing\n /\n    \n          Asia\n\nDisquiet on the Western Front: A Divided Resistance in Myanmar’s Chin State\n\n\nAlso available in Burmese\n\nBriefing\n /\n    \n          Asia\n\nAlso available in Burmese\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommentary\n /\n    \n          Global\n\n10 Conflicts to Watch in 2025\n\n\nAlso available in Arabic, Français, Russian and other languages\n\nCommentary\n /\n    \n          Global\n\nAlso available in Arabic, Français, Russian and other languages\n\nSubscribe to Crisis Group’s Email Updates\n\n\n\nReceive the best source of conflict analysis right in your inbox.",
  "entities": {
    "countries": [
      "china",
      "india",
      "russia"
    ],
    "organizations": [
      "un",
      "who"
    ],
    "key_issues": [
      "issue",
      "problem",
      "challenge",
      "concern",
      "crisis",
      "country",
      "nation",
      "state",
      "government",
      "region",
      "policy",
      "history",
      "humanitarian",
      "aid",
      "assistance",
      "relief",
      "economy",
      "financial",
      "un",
      "ngo"
    ]
  },
  "committee": "First Committee",
  "topic": "Combating the rise of extremist groups in the Sahel"
}